{"website": {"company_name": "INFARM", "website_content": {"https://www.infarm.de/products/scarlet-kale": "Translated: Products The feed Find Us Join us Scarlet Kale Striking purple streaked leaves reveal a satisfying umami flavour with hints of nuts & peppery mustard . Give it a whirl Scarlet Kale has a flexible versatility that lends itself well to almost everything, whether dressed up in mixed green salad or dressed down and fried into a deliciously simple crispy Kale chip. However, due to its tender texture and nuanced umami flavour, we love it best when served raw. Folate Vitamin C Vitamin K Manganese Recipes Autumn sauteed chanterelles in brown sage butter Make It Back to the roots Greek Basil Bordeaux Basil Mustard Mix See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/lemon-star": "Translated: Products The feed Find Us Join us Lemon Star The radiant Lemon Star is sure to dazzle your tastebuds with its tropical taste. Give it a whirl Lemon Star is a star ingredient in South American cuisine. It is traditionally ground into a paste and added to potato dishes. Chop finely and sprinkle on top of seafood to lend a fresh, cooling taste. Antiviral Digestion Medicinal antifungal Recipes Autumn, Winter Green Mint tea Make It Back to the roots Scarlet Kale Parsley Sage See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/thai-basil": "Translated: Products The feed Find Us Join us Thai Basil These narrow , pointed green leaves hide an enchanting anise aroma and a hint of spice . Give it a whirl The spicy aniseed aroma is wonderful when slivered and added to salads to create a unique bouquet of flavours. The hardy leaves also stand up well to heat, so Thai Basil makes for a delicious infusion into hot dishes. It’s at its best when used in Thai or Vietnamese cuisine, especially paired with a coconut milk base, to bring an excellent spicy sweetness that really rounds out the dish. Iron Vitamin E Potassium Magnesium Recipes Summer Pasta Italian pesto Make It Back to the roots Crystal Green Pea Red Veined Sorrel See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/red-stem-mizuna": "Translated: Products The feed Find Us Join us Red Stem Mizuna Slender feathery leaves with a peppery tang , we love how the crimson hue dresses up our plate. Give it a whirl The distinct mustard taste is best enjoyed raw and mixed together with other leafy greens for a vibrant and flavour-forward salad. It also makes an aesthetic addition to sandwiches and pasta salads. We find the peppery, piquant flavour and mildly bitter cabbage aftertaste works especially well with fruits and nuts. Iron Fibre Folate Vitamin A Recipes Spring Green salad Make It Back to the roots Purple Baby Pak Choi Golden Frills Mustard Peruvian Mint See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/peruvianmint": "Translated: Products The feed Find Us Join us Peruvian Mint Our luscious Peruvian Mint has an intense tropical fragrance. Give it a whirl Traditionally ground into a paste and used to infuse a wide-variety of cream dishes with mouth-watering fragrance and flavour, Peruvian Mint can be used in the same way as coriander: stirred through ceviche, scattered over chicken or fish dishes and sprinkled into soups and stews. We also find that the notes of mint and tropical fruit pair perfectly with all kinds of desserts, especially those with a dairy or coconut milk base. Antiviral Digestion Medicinal Antifungal Recipes Autumn, winter Spearmint tea Make It Back to the roots Dijon Mustard Bordeaux Basil Crystal See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/wasabi-rocket": "Translated: Products The feed Find Us Join us Wasabi Rocket Our Wasabi Rocket has a unique fiery flavour in every bite . Give it a whirl Sinus-blazing and tear-dropping but in a good way? To start, try out this zesty green with the Asian flavours that you typically associate with wasabi. As you grow more daring, you can begin to work with the Wasabi Rocket as you would normally use rocket: on pizza to influence the dairy qualities, with grilled fish or in a flavour packed sandwich or salad. Iron Folate Calcium Vitamin A Recipes Spring green salad Make It Back to the roots Green Pea Green Baby Pak Choi Red Veined Sorrel See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/red-romaine": "Translated: Products The feed Find Us Join us Red Romaine Our Red Romaine lettuce is modestly sweet with a delightful crunchy texture. Give it a whirl Adds a burst of colour and extra crunch to your favourite sandwich or wrap. The snappy leaves go perfectly in a mixed greens salad, and the mild and pleasantly neutral taste mixes well with other sweet and bitter flavours. Fibre Folate Vitamin A Potassium Recipes Spring green salad Make It Back to the roots Dijon Mustard Red Veined Sorrel Italian basil See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/find-us": "Translated: Products The feed Find Us Join us Find Us Find your neighbourhood farm. Submit OOOPS, WE CAN NOT FIND THE LOCATION YOU WERE LOOKING FOR. BUT WE ARE LIVE IN THESE EUROPEAN COUNTRIES: 100% local We believe your food shouldn’t have travelled more than you have, so we grow everything in your neighbourhood. Nutritious produce from all around the world, so fresh it is still living, right where you are. Berlin Talking with Michelin starred Chef Tim Raue Watch the video London Introducing Infarm to the UK with M&S Watch the video Seattle Kroger brings farming to its stores Financial post Copenhagen Introducing Infarm to Copenhagen with Irma Watch the video Back to the roots Bordeaux Basil Green Baby Pak Choi Red Veined Sorrel See All Products Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products": "Translated: Products The feed Find Us Join us Unleash Flavour & Goodness Bordeaux Basil Crystal Dijon Mustard Golden Frills Mustard Pesto Pasta Make it Greek Basil Green Baby Pak Choi Green Pea Lemon Star Potato Salad with Salsa Verde Make it Purple Baby Pak Choi Mountain Coriander Thyme Italian basil Fig Caprese Salad Make it Red Romaine Red Stem Mizuna Red Veined Sorrel Lemon Balm Melissa Green Salad Make it Thai Basil Parsley Lemon Basil Mustard Mix Chanterelle mushrooms Make it Scarlet Kale Sage Wasabi Rocket Green Mint Tea Make it Green mint Curly parsley Peruvian Mint How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/red-veined-sorrel": "Translated: Products The feed Find Us Join us Red Veined Sorrel This vibrant little leaf brightens everything it touches with its intense lemony tang . Give it a whirl This zippy herb has a unique acidity that makes a delightful addition to eggs, potatoes, soups and gratins, or in a creamy sauce that goes along with the main course. The red veins that run along its bright green leaves give a beautiful and decorative contrast as a garnish and the pronounced tang also works well in a dessert to brighten and offset the sweet taste. Iron Vitamin A Vitamin C Potassium Recipes Fresh summer picnic potato salad salsa verde Make It Back to the roots Sage Red Veined Sorrel Thyme See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/mountain-coriander": "Translated: Products The feed Find Us Join us Mountain Coriander Our Mountain Coriander's frilly leaves may look gentle , but its flavour packs a punch . Give it a whirl Delicious sprinkled on top of a fragrant curry, and its sweet, earthy taste is the essential element for mouthwatering, homemade guacamole. Mash two ripe avocados and mix with red onion, lemon juice, sea salt, pepper and a sprinkle of chili. Top with the delicate coriander leaves to taste, and voila — a magnificent side dish bursting with flavour. Soothing Vitamin A Vitamin C Vitamin K Recipes Fig Caprese Salad Make It Back to the roots Greek Basil Crystal Bordeaux Basil See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/articles/recipe-chanterelle-mushrooms": "Translated: Products The feed Find Us Join us Autumn Sauteed chanterelles in brown sage butter Ingredients Serves: 2 people 100 gr butter 1 bunch Sage 250 gr chanterelles Salt and pepper Preparation Melt the butter in a deep frying pan and bring it to bubble. Once bubbling, add all the sage leaves and cook for 2-3 minutes, then remove and put aside for later. Add all the mushrooms in a single layer and cook until the bottom side is golden. Sprinkle with a few pinches of salt and freshly ground black pepper, and reduce the heat to medium. Turn the mushrooms and cook for another 3-4 minutes, stirring occasionally until the mushrooms are tender. Season with additional salt, pepper and the crispy sage leaves you made earlier. Tip If you would like to store your Chanterelles, we suggest sauteing them in butter and then freezing, as this preserves the most flavour. Get inspired Fig Caprese Salad Make it Green Salad Make it Back to the roots Sage Scarlet Kale Wasabi Rocket See All Products Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de": "Translated: Products The feed Find Us Join us We're the infarmers and your city is our farm Find a farm 100% Local We believe your food shouldn’t have travelled more than you have, so we grow everything in your neighbourhood. Nutritious produce from all around the world, so fresh it is still living. Copenhagen Introducing Infarm to Copenhagen with Irma Watch the video Seattle Introducing Infarm to Seattle with Kroger Watch the video London Introducing Infarm to the UK with M&S Watch the video Berlin Talking with Michelin starred Chef Tim Raue Watch the video Back to the roots Bordeaux Basil Green mint Scarlet Kale See all Products all TASTE no waste Explore More Find A Farm Near you Farms 610 50 Today Water saved* 3172000 Litres Transport saved* 1525000 Kilometers Land saved* 24400 Squaremeters How we grow flavour and goodness Controlled Environment Cloud Farming Pure & Tasty Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/italian-basil": "Translated: Products The feed Find Us Join us Italian basil A buzz with lively flavour , these leaves are both sweet & sharp Give it a whirl We love to put the Italian Basil on everything from indulgent pizzas to pasta dishes to refreshing caprese salads. Or keep it simple with a fresh and flavourful homemade pesto. Iron Potassium Magnesium Antioxidant Recipes Summer Pasta Pesto Make It Back to the roots Purple Baby Pak Choi Green mint Crystal See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/articles/recipe-potato-salad-salsa-verde": "Translated: Products The feed Find Us Join us Summer potato salad with salsa verde Ingredients Serves: 2 people 200 gr waxy potatoes, peeled and cooked in salted water 70 ml sunflower oil 1 red onion 4 radish 2 tablespoon Dijon mustard 1 tablespoon capers 2 hard boiled eggs 3 bunches of Curly Parsley 10 gr salt 10 gr sugar zest from a lemon Preparation In a food processor puree parsley stems with oil, mustard, salt, sugar, lemon zest and the cooked potatoes, until it reaches a creamy consistency. Set parsley leaves aside in ice cold water. Mix potatoes while still warm with the green sauce. Add capers, sliced onions and parsley leaves. Mix all ingredients. Tip When chopping herbs always use a sharp knife to not damage the leaves and to retain their bright colour and strong flavour. Get Inspired Green Mint Tea Make it Green Salad Make it Back to the Roots Golden Frills Mustard Peruvian Mint Green Baby Pak Choi See All Products Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/lemon-basil-melissa": "Translated: Products The feed Find Us Join us Lemon Balm Melissa Let our sweet, soothing Lemon Balm Melissa ease your woes. Give it a whirl The gentle lemon sweetness beautifully complements fish dishes, root vegetables and refreshing side salads. We also love using Lemon Balm Melissa to brighten up syrups or as a garnish for desserts. Add a generous handful of fresh leaves to hot water for a comforting tea that will help relieve your stress. Antiviral Antioxidant Antibacterial Mild Sedative Recipes Autumn, Winter Green Mint Tea Make It Back to the roots Bordeaux Basil Golden Frills Mustard See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/purple-baby-pac-choi": "Translated: Products The feed Find Us Join us Purple Baby Pak Choi Our Purple Pak Choi has a sweet , slightly bitter tang & a lush crispy texture. Give it a whirl The earthy, umami flavour and crispy texture is delicious when served raw in a salad or used to dip into sauces and spreads. An all-purpose vegetable in Asian cuisine, it pairs well with a large variety of vegetable dishes and we especially love how the decorative lilac colour enriches the complexion of our plate. Vitamin A Vitamin C Vitamin K Antioxidant Recipes Spring Green salad Make It Back to the roots Red Stem Mizuna Lemon Star Mountain Coriander See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/thyme": "Translated: Products The feed Find Us Join us Thyme Our Thyme has tender leaves but a powerful , robust taste. Give it a whirl Bundle together with flat parsley and bay leaves to create a classic “bouquet garni” that can be added to any soup, stock or casserole to bring new depth of flavour. Try sprinkling some fresh Thyme onto baked camembert for a delectable appetizer with an extra satisfying herbal element. Iron Calcium Vitamin C Magnesium Recipes Autumn sauteed chanterelles in brown sage butter Make It Back to the roots Golden Frills Mustard Dijon Mustard Bordeaux Basil See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/green-baby-pak-choi": "Translated: Products The feed Find Us Join us Green Baby Pak Choi Our Green Baby Pak Choi is a delightful blend of sweet & earthy flavours with a crunchy bite. Give it a whirl The three main methods to work with Pak Choi are to stir-fry, steam or simmer it. However, these budding Green Baby leaves also taste great raw, as a sweet and slightly bitter addition to your refreshing salad, with perhaps a mustard vinaigrette and a drop of sesame oil. Vitamin A Vitamin c Vitamin K Antioxidant Recipes Spring green salad Make It Back to the roots Dijon Mustard Peruvian Mint Bordeaux Basil See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/dijon-mustard": "Translated: Products The feed Find Us Join us Dijon Mustard This dainty Dijon Mustard microgreen holds a spicy secret. Give it a whirl Sandwiches, wraps and burgers benefit from the texture of these tender, succulent leaves and their powerful pop of flavour. We also love to use this microgreen as a colourful garnish on seafood dishes and sushi platters. Zinc Folate Vitamin A Manganese Recipes Autumn Sauteed chanterelles in brown sage butter Make It Back to the roots Purple Baby Pak Choi Italian basil Peruvian Mint See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/sage": "Translated: Products The feed Find Us Join us Sage Our Sage’s warm & musky flavour goes hand-in-hand with its floral fragrance. Give it a whirl Known for generations as an essential medicinal herb, Sage’s strong flavour will save your savoury dishes or heal your ailments in a comforting cup of tea. Take a leaf out of the Italian cookbook and try a pinch of fresh Sage with extra virgin olive oil and garlic for a satisfyingly simple pasta dish. Copper Vitamin B6 Magnesium Antimicrobial Recipes Autumn *Sauteed chanterelles* in brown sage butter Make It Back to the roots Lemon Star Wasabi Rocket Red Veined Sorrel See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/articles/recipe-fig-capreze": "Translated: Products The feed Find Us Join us Spring, Summer Fig Caprese Salad Ingredients Serves: 2 people 3 fresh figs 1 tablespoon pistachios 1 large, fresh ball of mozzarella or burrata Bunch of Bordeaux or greek basil 1 tablespoon pistachios 1 tablespoon olive oil 1 tablespoon pomegranate syrup Preparation Use your hands to gently pull apart the figs into uneven, bite sized pieces and place onto a serving plate. Repeat this step with the mozzarella, placing the pieces onto the plate next to the figs. Sprinkle with olive oil, pomegranate syrup, pistachios and the basil leaves. Tip Try tearing the basil leaves with your fingers just before serving for a more striking basil perfume. Get inspired Green Salad Make it Chanterelle mushrooms Make it Back to the Roots Bordeaux Basil Peruvian Mint Greek Basil See All Products Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/green-mint": "Translated: Products The feed Find Us Join us Green Mint this Green Mint is buzzing with flavour . Give it a whirl Great fresh or cooked, in both sweet and savory dishes. Versatile and dynamic, try infusing boiling water with fresh mint leaves for a cup of tea loaded with medicinal properties. Iron Vitamin A Manganese Antispasmodic Recipes Autumn, Winter Green Mint tea Make It Back to the roots Green Baby Pak Choi Wasabi Rocket Thyme See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/articles/recipe-green-salad": "Translated: Products The feed Find Us Join us Spring green salad Ingredients Serves: 2 people 1 crystal lettuce 3 tablespoons olive oil 2 radishes 1 bunch of Lemon Basil 1 tablespoon apple cider 1 teaspoon lemon juice 1 teaspoon sugar 1 teaspoon Dijon mustard Preparation Place olive oil, vinegar, lemon juice, sugar and Dijon mustard into a jar, close the lid tightly and shake vigorously until a smooth sauce is formed. Pull off the Crystal Lettuce leaves, pluck the leaves off of the Lemon Basil and thinly slice the radishes. Combine in a bowl and pour over ingredients just before serving. Tip There are two things salad greens need to stay crisp: moisture and air, so for an extra crisp lettuce cool it in the fridge, covered with damp paper towels. Get inspired Fig Caprese Salad Make it Green Mint Tea Make it Back to the Roots Scarlet Kale Wasabi Rocket Red Veined Sorrel See All Products Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/articles/recipe-spearmint-tea": "Translated: Products The feed Find Us Join us Autumn, winter Green Mint Tea Ingredients Serves: 3 cups 3 cups of water 1 bunch of Mint , use both the stems and leaves 1 rose petal 1 cinnamon stick Honey, optional Preparation Place the water, rose petal and cinnamon stick into a small pot and bring to boil. After a minute, remove from heat and add the mint. Let steep for 4 minutes with the lid on. Strain and serve, adding honey if desired. Tip No need to chop the leaves, only slightly bruise them to release the aroma from their oil glands. Get inspired Potato Salad with Salsa Verde Make it Pesto Pasta Make it Back to the Roots Crystal Green mint Mountain Coriander See All Products Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/green-pea": "Translated: Products The feed Find Us Join us Green Pea Our budding Green Peas have exquisite tendrils of sweet , nutty flavour. Give it a whirl To retain their nutritional benefits, our Green Pea shoots are best served raw or very gently steamed or sautéed. We love the nutty, sweet flavour and earthy aroma they bring to salads, smoothies or green juices. The translucent light green stems and petite bright green leaves also make for a lovely garnish on pizzas and soups. Iron Fibre Calcium Vitamin A Recipes Summer Pesto Pasta Make It Back to the roots Thai Basil Wasabi Rocket Sage See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/the-feed": "Translated: Products The feed Find Us Join us Follow us as we expand across the globe Global COVID-19 and our Infarm Commitment to You Infarm blog Global Infarm — A few of our most frequently asked questions Infarm blog Global Celebrating Global G.A.P certification and best farming practices at Infarm Infarm blog Global Pushing the boundaries of agriculture Infarm youtube North America They grow it right in the supermarket The Fast Company Europe Infarm expands its ‘in-store farming’ to Paris Tech crunch Europe Elysée kitchens already a fan - French article Le Parisien Europe Intelligent solutions for food production EIF Europe Infarm x metro group Infarm Youtube Global The agriculture cloud Forbes Global 'Indoor farms' backed by Skype billionaire Telegraph Europe The herbal chamber of the future - German article Morgenpost Asia Supermarket Growing Vegetables - Korean Article Vogue Korea Europe Marks & Spencer rolls out urban farms to more shops Forbes Seattle Kroger brings farming to its stores Financial post Back to the Roots Bordeaux Basil Mustard Mix Green Baby Pak Choi See All Products Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/crystal": "Translated: Products The feed Find Us Join us Crystal These Crystal Lettuce leaves are sweet & crunchy . Give it a whirl Delicately sweet and refreshingly crispy, it’s the ideal accompaniment to your burgers and sandwiches, adding the perfect crunch in every bite. Crystal Lettuce is unique in that it retains its crispy texture even when mixed with warm foods, so we like to add it to traditional Asian dishes for a playful twist. Fibre Folate Potassium Manganese Recipes Spring green salad Make It Back to the roots Lemon Balm Melissa Curly parsley Red Stem Mizuna See all products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/bordeaux": "Translated: Products The feed Find Us Join us Bordeaux Basil A blend of peppery and minty fun, this bordeaux beauty will turn any green salad into a flavoursome experience. Give it a whirl Its distinctive ruby flourish makes this basil a gorgeous addition to green salads and side dishes. It brings a rich peppery flavour with a hint of mint and a spicy aroma. We love to mix it with sugar, lemon juice, water and ice for a blushing pink lemonade. Iron Vitamin A Potassium Magnesium Recipes Summer, Spring Fig ‘capreze’ Make It Back to the roots Lemon Star Lemon Basil Green Baby Pak Choi See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/imprint": "Translated: Products The feed Find Us Join us imprint InFarm – Indoor Urban Farming GmbH Colditzstr. 30 12099 Berlin Germany Managing Directors: Erez Galonska Guy Galonska Osnat Michaeli Contact: Phone: +49 (30) 9919165 90 E-Mail: info@infarm.com Registery: Registered at: Amtsgericht Berlin Register number: HRB 152466B Value Added Tax-ID: DE291151333 Content disclaimer As a service provider, we are responsible for our own content on this website according to § 7 par.1 TMG and general German laws. According to §§ 8 to 10 TMG, however, we are not obligated to monitor third-party information sent to or saved on our website or to investigate any circumstances that may indicate illegal activity. This does not affect our obligations under general laws to remove or block the use of information. However, we can assume liability for taking such action only from the time we receive knowledge of a specific legal violation or infringement of rights. We will remove such content from our website as soon as possible after we receive knowledge of any respective legal violations or infringement of rights by said information. Liability for links Our website contains links to external third-party websites that are not under our control. For this reason, we cannot assume any guarantees for this third-party content. The particular party offering or operating third-party sites is solely responsible for the content of the pages linked to our website. The linked pages were reviewed for any possible legal violations or infringement of rights at the time they were linked. Illegal content could not be discerned at that time. However, it is not reasonable for us to continuously monitor the linked pages without having received any specific indication of a rights violation by said content. Upon receiving knowledge of such legal violations, we will remove the corresponding links as soon as possible. Copyright law All content published on this website is protected by laws for protection of intellectual property. Reproduction, modification, distribution and any other use outside the limits of copyright law requires the prior written consent of the author or creator of the content. Downloading and copying content from this website is solely permitted for private use, not for commercial purposes. In the event that contents on this page were not created by the person(s) operating the page, third-party copyrights have been observed. Third-party contents are labelled as such. Nevertheless, if you happen to discover a copyright infringement, please bring it to our attention. Upon receiving knowledge of such violations, we will remove the corresponding content as soon as possible. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/golden-frills-mustard": "Translated: Products The feed Find Us Join us Golden Frills Mustard With its potent mustard flavour & mild peppery finish, this cheeky Golden Frills Mustard loves to toy with your tastebuds . Give it a whirl This spicy aromatic green goes great in a salad and can hold its own against a range of vinaigrettes. The raw leaves are quite powerful, but upon cooking, a softer cabbage flavour begins to emerge. Delicious in an omelette or spring roll and pairs well with pork, grilled fish and creamy cheese flavours. Iron Calcium Riboflavin Vitamin B6 Recipes Summer, Spring Fig ‘capreze’ Make It Back to the roots Green Pea Crystal Bordeaux Basil See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/parsley": "Translated: Products The feed Find Us Join us Parsley This distinctive Parsley has an enduring flavour & an earthy essence. Give it a whirl The entire plant can be used to add a distinctive, long-lasting taste to your curries and chutneys. It delivers a bright woody essence when chopped and added to raw veggies along with a splash of lemon juice. Plus, chewing some fresh parsley can help eliminate bad breath, thanks to its antibacterial and antifungal properties. Fibre Sodium Vitamin C Potassium Recipes Fresh summer picnic potato salad salsa verde Back to the roots See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/join-us": "Translated: Products The feed Find Us Join us Become an infarmer We want to help solve one of the toughest sustainability challenges today: feeding the cities of tomorrow. If you see yourself reflected in our values and the size of the challenge ahead excites you, we’d like to meet you. Berlin People Operations Manager (m/w/d) Apply now New York Senior Supply Chain Manager (m/w/d) Apply now Berlin Media Relations Manager (m/w/d) Apply Now BERLIN Product Manager - Software (m/w/d) APPLY NOW Berlin Industrial Engineer (m/w/d) Apply now See all open positions You appreciate diversity Every day teams of infarmers from more than 40 countries around the world are working together to unlock the solutions to global problems. If you’re ready to bring the best of yourself, your expertise and your perspectives to this mix - we’ll create rich solutions, together. You love to be challenged Whether you’re an industrial engineer or a horticulturalist, a biologist or a marketer, you must be willing to look beyond what you already know to create something new. This is what drives every infarmer and should light a fire in you too. You are passionate At infarm we want to up-end industrial agriculture to reconnect people with the experience and flavor of fresh, sustainably-grown food, right in their neighborhoods. As infarmers this is our aim. As a society, this must be our future. If what we’ve shared sparks a passion in you to do the same, infarm might be the place for you. Join us See all open positions and join us on our journey Apply now Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/lemon-basil": "Translated: Products The feed Find Us Join us Lemon Basil With its fresh citrus fragrance & striking notes of anise, our zesty Lemon Basil shines in rice & raw vegan dishes. Give it a whirl Lemon Basil has earned a prominent place in Thai, Laotian, Indonesian and Middle Eastern cuisine, where it is often used in curries and soups. We also like to use it as a garnish for baked fish or to add a subtle citrus twist to classics like vanilla ice cream, cookies and homemade tea. Iron Vitamin A Potassium Magnesium Recipes Spring Green salad Make It Back to the roots Mustard Mix Red Romaine Red Veined Sorrel See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/mustard-mix": "Translated: Products The feed Find Us Join us Mustard Mix This peppery ménage à trois is ready to spice up your life . Give it a whirl The subtle spicy fragrance and intense flavour of this combo is great for adding a new dimension to salads. The raw leaves have a powerful taste but when cooked, softer cabbage flavours come through. Try the mixture stir-fried or in soups, curries and stews: the intense, spicy, and long-lasting taste goes well with almost anything. Iron Calcium Vitamin A Riboflavin Recipes Spring Green salad Cook It Back to the roots Green Pea Green Baby Pak Choi Crystal See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/curly-parsley": "Translated: Products The feed Find Us Join us Curly Parsley This high-powered Curly Parsley is truly intoxicating. Give it a whirl The mild, earthy essence works in a variety of savoury dishes or as a delightful garnish thanks to its silky texture and versatile flavour profile. We love to chop it finely (to allow the slightly fruity fragrance to emerge) and add it to soups and sauces. Plus, it is our key ingredient to make mouthwatering tabbouleh. Iron Fibre Folate Protein Recipes Fresh summer picnic potato salad salsa verde Make It Back to the roots Golden Frills Mustard Greek Basil Green Baby Pak Choi See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/products/greek-basil": "Translated: Products The feed Find Us Join us Greek Basil Greek Basil is smaller & punchier than its Italian cousin. Give it a whirl Greek Basil’s bite-sized leaves are perfect for sprinkling over pasta and salads. For the adventurous mixologists: the herb’s sweet taste and enticing aroma makes it a great garnish for a sassy cocktail. Iron Vitamin K Potassium Magnesium Recipes Summer Pasta Italian pesto Make It Back to the roots Mustard Mix Thai Basil Scarlet Kale See All Products How we grow flavour and goodness Cloud Farming Controlled Environment Pure & Tasty We remotely control all Infarms through our cloud-based farming platform. It learns, adjusts and improves itself continuously, so each plant grows better than the last. Each Infarm is a controlled ecosystem with the perfect amount of light, air & nutrients. An optimal set of conditions that enables our plants to express their natural tastiness to the fullest. By keeping the roots on, our plants keep all of their flavour and goodness. 100% free of chemical pesticides, so you have the freshest and healthiest produce. Taste the difference. Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close", "https://www.infarm.de/articles/recipe-pasta-italian-pesto": "Translated: Products The feed Find Us Join us Summer Pesto Pasta Ingredients Serves: 2 people 200 gr pasta 25 gr parmesan cheese 25 ml of olive oil 10 gr toasted pine nuts Leaves from 2 bunches of Greek and/or Italian Basil 1 garlic clove 2 pinches of salt Preparation Bring the water to boil with a pinch of salt, pour in the pasta. While cooking the pasta, combine all other ingredients in a food processor and pulse. The pesto is finished when all ingredients are processed but not too creamy, as the consistency should still have a little bit of texture. When the pasta is al dente, strain and mix in the pesto. Garnish with some basil leaves and extra Parmesan. Tip To prevent the pesto from oxidising (browning), blanche the leaves before use. Place the basil leaves in boiling water for 30 seconds and then quickly pop them into a bowl of ice water. Gently dry them and proceeding with the recipe. Get inspired Green Salad Make it Chanterelle mushrooms Make it Back to the Roots Red Stem Mizuna Italian basil Mustard Mix See All Products Newsletter Be the first to hear the latest from the front line of the urban farming (r)evolution. Contact Join us Imprint Privacy This site uses cookies in order to provide you with the best possible service. Agree Close"}, "external_links": {"medium": ["https://medium.com/@infarm.com"], "instagram": ["http://instagram.com/infarm"], "youtube": ["https://www.youtube.com/watch", "https://www.youtube.com/c/INFARM"], "linkedin": ["https://www.linkedin.com/company/infarm-wearetheinfarmers"], "other_links": ["https://boards.greenhouse.io/infarm/jobs/4544234002", "https://boards.greenhouse.io/infarm/jobs/4537786002", "https://business.financialpost.com/pmn/business-pmn/kroger-brings-farming-to-its-stores-in-push-to-get-greener-and-sell-more-kale", "https://boards.greenhouse.io/infarm/jobs/4672807002", "https://boards.greenhouse.io/infarm", "https://boards.greenhouse.io/infarm/jobs/4615820002", "https://boards.greenhouse.io/infarm/jobs/4537945002"], "facebook": ["https://www.facebook.com/infarm.wearetheinfarmers"]}, "website_url": "http://www.infarm.de/", "internal_links": ["https://www.infarm.de/products/lemon-basil", "https://www.infarm.de/products/green-mint", "https://www.infarm.de/products/lemon-basil-melissa", "https://www.infarm.de/products/green-pea", "https://www.infarm.de/products/thai-basil", "https://www.infarm.de/articles/recipe-green-salad", "https://www.infarm.de/products/golden-frills-mustard", "https://www.infarm.de/products/scarlet-kale", "https://www.infarm.de/articles/recipe-potato-salad-salsa-verde", "https://www.infarm.de/find-us", "https://www.infarm.de/products/dijon-mustard", "https://www.infarm.de/products/peruvianmint", "https://www.infarm.de/articles/recipe-pasta-italian-pesto", "https://www.infarm.de/articles/recipe-fig-capreze", "https://www.infarm.de/products/wasabi-rocket", "https://www.infarm.de/products/red-stem-mizuna", "https://www.infarm.de/products/greek-basil", "https://www.infarm.de/articles/recipe-spearmint-tea", "https://www.infarm.de/products/lemon-star", "https://www.infarm.de/products/curly-parsley", "https://www.infarm.de/products/red-veined-sorrel", "https://www.infarm.de/products/bordeaux", "https://www.infarm.de", "https://www.infarm.de/products/mountain-coriander", "https://www.infarm.de/the-feed", "https://www.infarm.de/products/thyme", "https://www.infarm.de/articles/recipe-chanterelle-mushrooms", "https://www.infarm.de/products/purple-baby-pac-choi", "https://www.infarm.de/products", "https://www.infarm.de/imprint", "https://www.infarm.de/join-us", "https://www.infarm.de/products/green-baby-pak-choi", "https://www.infarm.de/products/sage", "https://www.infarm.de/products/crystal", "https://www.infarm.de/products/parsley", "https://www.infarm.de/products/mustard-mix", "https://www.infarm.de/products/italian-basil", "https://www.infarm.de/products/red-romaine"]}, "indeed": null, "twitter": {}, "medium": [{"url": "https://medium.com/@infarm.com", "text": "Open in app  Become a member Sign in infarm Follow We are the infarmers and your neighbourhood is our farm 1 Following 54 Followers Profile Claps Latest infarm Apr 7  ·  2 min read Welcome Carmine Visconti, CFO to the Infarm Team — by Erez Galonska, CEO and co-founder @ infarm I’m happy to announce that Carmine Visconti has joined Infarm as our Chief Financial Officer. He comes from UBS, where he led the firm’s Technology Practice for Europe as… 13 infarm Mar 24  ·  2 min read COVID-19 and our Infarm Commitment to You As Infarm along with businesses around the world respond to the dynamic situation… 26 infarm Feb 6  ·  2 min read Celebrating GlobalG.A.P certification and best farming practices at Infarm 14 infarm Nov 21, 2019  ·  2 min read Grown and harvested in stores, Infarm produce, now in Copenhagen Infarm grew out of our genuine passion for food. After you uncover the layers of (fascinating) technology and engineering, and comb through stellar work by biologists, plant scientists and… 4 infarm Nov 20, 2019  ·  5 min read Infarm — A few of our most frequently asked questions 42       ", "title": "infarm – Medium"}]}