{"website": {"company_name": "Hyperdrive Innovation", "website_content": {"https://hyperdriveinnovation.com/insights/blog/our-top-electric-finds-at-bauma": "Translated: us today Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/double-win-for-hyperdrive-at-the-sunderland-echo-portfolio-awards": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > Double win for Hyperdrive at the Sunderland Echo Portfolio Awards Double win for Hyperdrive at the Sunderland Echo Portfolio Awards News 8th November, 2019 Hyperdrive takes home Medium Business of the Year and Best Use of Technology Hyperdrive has won two awards at the Sunderland Echo Portfolio Awards! Celebrating the best in business the region has to offer, the awards are an opportunity to showcase innovative companies making a difference regionally and nationally. Chris Pennison, CEO, commented, “To win two awards for a second year running is great testament to our fantastic team and their continued efforts. We’re very proud to be a north east company that supplies businesses globally with cleaner and better technology, all from our site here in Sunderland.” The awards took place on Thursday 7th November at the Stadium of Light in Sunderland, with over 300 key people from the region in attendance. Congratulations to all of the other winners! Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/page/3": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > News News Page: 3 All Blog Events News News 2nd November, 2018 Double win for Hyperdrive at Sunderland Echo Portflio Awards Read post News 19th October, 2018 Hyperdrive bag Automotive Award for second year running Read post News 16th October, 2018 Hyperdrive recertifed for ISO 9001:2015 accreditation Read post News 16th October, 2018 Silent Power project showcased at LCNI 2018 Read post News 2nd October, 2018 Hyperdrive donates £2,000 to inspire local children into STEM careers Read post News 11th September, 2018 Hyperdrive and Offgrid Energy bring industry-leading collaboration to Northern Powergrid’s Silent Power Project Read post News 10th September, 2018 Hyperdrive Innovation named in The Sunday Times Tech Track 100 Ones to Watch Read post News 6th August, 2018 Hyperdrive celebrates 5000th battery pack landmark as it plans further expansion Read post News 4th July, 2018 Hyperdrive announce new CTO Read post ← 1 2 3 4 5 6 … 8 9 10 → Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/page/2": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > News News Page: 2 All Blog Events News News 16th October, 2019 Hyperdrive partners with Northern Powergrid on revolutionary new trial Read post News 17th September, 2019 Hyperdrive ranked 40th in the Sunday Times Tech Track 100 Read post News 11th July, 2019 Welcome to HYVE, the UK’s largest independent battery pack manufacturing facility Read post News 24th June, 2019 Hyperdrive win the Automotive Award at Made in the UK Awards 2019 Read post News 20th February, 2019 Hurricanes visit Hyperdrive Innovation for STEM Day Read post News 18th January, 2019 Hyperdrive and Hybria form partnership to deliver electric vehicles for all weather conditions Read post News 3rd January, 2019 Introducing our Charity of the Year 2019 Read post News 18th December, 2018 The Hyperdrive Journey: Our film in collaboration with the APC Read post News 28th November, 2018 Hyperdrive secures £6.7 million equity funding boost from shareholders Read post ← 1 2 3 4 5 … 8 9 10 → Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/page/9": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > News News Page: 9 All Blog Events News News 21st July, 2014 Work Gets Underway on Jonny Smith’s EV Hot Rod Read post News 15th July, 2014 Formula E School Initiative Launched Read post News 11th July, 2014 IMechE Lecture – Recent Innovations in Electric Vehicle Technology Read post News 8th June, 2014 Official Opening of the Future Technology Centre Read post News 5th June, 2014 Charging Ahead – IMECHE Professional Engineering Feature Read post News 19th May, 2014 Charging Up For A Cleaner Fleet Read post News 11th May, 2014 Electric Vehicle – Product Commercialisation Opportunity Read post News 28th April, 2014 Hyperdrive Innovation On The Move Read post News 13th February, 2014 Newcastle Science City case study Read post ← 1 2 3 … 6 7 8 9 10 → Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/page/8": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > News News Page: 8 All Blog Events News News 5th July, 2015 Battery Production Facility Opens for Business Read post News 23rd April, 2015 Initiative to find new opportunities in the automotive supply chain Read post News 15th April, 2015 Niche Vehicle Network – Hybrid Atom Stop Start Concept Read post News 25th December, 2014 C-Enduro completes offshore trials in Scotland Read post News 24th November, 2014 Lift Off for Flux Capacitor Read post News 24th October, 2014 Flux Capacitor Update #8 Read post News 2nd October, 2014 Big Robot Fleet Takes to UK Waters Read post News 11th September, 2014 ISO 9001 Accreditation Read post News 6th August, 2014 C-Enduro Goes from Strength to Strength Read post ← 1 2 3 … 5 6 7 8 9 10 → Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/terms-and-conditions": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Terms and Conditions Terms and Conditions Copyright All Web site design, text, graphics, the selection and arrangement thereof, and all software compilations, underlying source code, software (including applets) and all other material on this Web site are copyright of Hyperdrive Innovation, or their content and technology providers. All rights reserved. Permission is granted to electronically copy and to print in hard copy portions of this Web site for the sole purpose of placing an order with Hyperdrive Innovation. Any other use of materials on this Web site including reproduction for purposes other than those noted above, modification, distribution, or republication without the prior written permission of Hyperdrive Innovation is strictly prohibited. Trademarks Hyperdrive Innovation services referenced on this Web site are either trademarks or registered trademarks of Hyperdrive Innovation, in the U.K and/or other countries. Other product and Hyperdrive Innovation names mentioned on this Web site may be the trademarks or registered trademarks of their respective owners. Disclaimer To the fullest extent permitted at law, Hyperdrive Innovation is providing this web site and its contents on an “as is” basis and makes no (and expressly disclaims all) representation or warranties of any kind, express or implied, with respect to this web site or the information, content, materials or products included in this site including, without limitation, warranties of merchantability and fitness for a particular purpose. In addition Horizonworks Marketing does not represent or warrant that the information accessible via this web site is accurate, complete or current. Price and availability information is subject to change without notice. Except as specifically stated on this Web site, to the fullest extent permitted at law, neither Hyperdrive Innovation nor any of its affiliates, directors, employees or other representatives will be liable for damages arising out of or in connection with the use of this Web site or the information, content, materials or products included on this site. This is a comprehensive limitation of liability that applies to all damages of any kind, including (without limitation) compensatory, direct, indirect or consequential damages, loss of data, income or profit, loss of or damage to property and claims of third parties. For the avoidance of doubt, Hyperdrive Innovation does not limit its liability for death or personal injury to the extent only that it arises as a result of the negligence of Hyperdrive Innovation, its affiliates, directors, employees or other authorised representatives. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/st-benedicts-hospice-named-as-hyperdrives-charity-of-the-year-2020": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > St Benedict’s Hospice named as Hyperdrive’s Charity of the Year 2020 St Benedict’s Hospice named as Hyperdrive’s Charity of the Year 2020 News 3rd March, 2020 Hyperdrive Innovation has today announced Sunderland based St Benedict’s Hospice as its Charity of the Year 2020. Established in 1984, St Benedict’s Hospice provides specialist palliative care to the people of Sunderland and surrounding districts. Providing a range of services across the whole community including day services, out-patients, care in the home, hospital or care home as well as in-patient beds, they have achieved Centre of Excellence status. As the only dedicated hospice to serve the City of Sunderland, it’s estimated that at any one time, they have approximately 300 patients using their services. After an extensive process of shortlisting a number of regional charities, Hyperdrive selected St Benedict’s Hospice in a company wide employee vote. The Hyperdrive team will take part in a calendar of fundraising activities throughout 2020 including sky diving, sporting events, bake off’s, dress down days and ongoing activities to fully support their new charity partner. Chris Pennison, CEO at Hyperdrive commented , “St Benedict’s Hospice is a fantastic charity that serves the community in which our team live and work. We were overwhelmed to learn that 1 in 3 people in our region will at some stage in their life require hospice care. On behalf of the Board, I’m inspired by the level of enthusiasm displayed by our team to support those living with an incurable illness and confident our partnership will be a success.” Anthony McDermott, Head of Corporate Relationships, Challenge Events and Digital Communications at St Benedict’s Hospice commented , “We are delighted to welcome Hyperdrive Innovation as the latest corporate supporter to pledge their allegiance to St Benedict’s Hospice across the next 12 months. In a challenging and at times competitive fundraising market, it’s imperative that we have the support of locally based businesses to help us achieve our aims. Having personally followed the success of Hyperdrive Innovation in recent years, it’s a true honour to have them on board and we’re looking forward to the year ahead” The partnership will officially begin on 1st March 2020 and will last 12 months. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/china": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > China Hyperdrive China 高性能能源系統 Hyperdrive開發了為電動汽車，家庭和企業提供動力的創新技術。我們正在向市場推出清潔能源替代化石燃料，與國內和國際品牌合作，為城市中心，建築工地和交通樞紐提供動力。 我們是第一家為我們自己的商業產品提供Envision AESC鋰離子電池技術的公司，擁有將我們置於技術進步前沿的關鍵知識產權。 專家設計 Hyperdrive將行業領先的鋰離子電池化學成分和經過驗證的Hyperdrive電池管理技術結合在一起，用於性能和封裝對成功至關重要的應用。設計和開發全部由機械，電子和固件專家在項目開始時與系統集成商一起進行。我們的工程師還可以從廣泛的領域獲得洞察力和專業知識，確保通過提供超緊湊的能量存儲，智能控制和集成以及低擁有成本的方式針對每種應用優化解決方案。 響應式製造 生產設計是我們所做的核心。從事原型設計階段，我們的內部製造團隊負責指導客戶進行批量生產。 這種與我們的工程功能無縫連接的內部能力將構建第一個原型，並將繼續通過試產和批量供應提供附加值。 通過適應標準技術平台，建立在行業領先技術的基礎上，並與當地供應鏈建立了牢固的關係，我們可以高度響應生產要求。憑藉可快速擴展的功能，我們為尋求汽車電氣化或電池儲能集成系統的客戶提供了一條商業化的快速通道。 Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/sitemap": "Translated: Smith: Electric Flux Capacitor v Nissan GT-R Europe’s Quickest Street Legal EV 12V Li-ion Battery Module Launched Newcastle Racing Formula Battery Production Facility Opens for Business Initiative to find new opportunities in the automotive supply chain Niche Vehicle Network – Hybrid Atom Stop Start Concept C-Enduro completes offshore trials in Scotland Lift Off for Flux Capacitor Big Robot Fleet Takes to UK Waters ISO 9001 Accreditation C-Enduro Goes from Strength to Strength Work Gets Underway on Jonny Smith’s EV Hot Rod Formula E School Initiative Launched IMechE Lecture – Recent Innovations in Electric Vehicle Technology Official Opening of the Future Technology Centre Charging Ahead – IMECHE Professional Engineering Feature Charging Up For A Cleaner Fleet Electric Vehicle – Product Commercialisation Opportunity Hyperdrive Innovation On The Move Newcastle Science City case study C-Enduro at the Maritime Showcase Hyperdrive Innovation on the up Trials get underway for unmanned sea vessel Hyperdrive Delivers Cue-V as Part of £25m Programme BMS developed for Jonny Smith flux capacitor Hyperdrive Innovation lights up Lumiere Festival Integrated electronic systems developed for ASV Hyperdrive win the Automotive Award at Made in the UK Awards 2019 Welcome to HYVE, the UK’s largest independent battery pack manufacturing facility See you at Cenex Low Carbon Vehicle Event 2019! What to expect from IMHX 2019 The female university student trailblazing the world of engineering Hyperdrive ranked 40th in the Sunday Times Tech Track 100 Hyperdrive partners with Northern Powergrid on revolutionary new trial Hyperdrive win Manufacturer of the Year 2019 Hyperdrive awarded battery supply contract for Snorkel’s industry leading zero emission Speed Level Double win for Hyperdrive at the Sunderland Echo Portfolio Awards Looking forward to 2020 Hyperdrive win Energy Innovation Award Hyperdrive partners with RS Sailing to power industry disrupting electric boat Celebrating our Charity of the Year 2019 Meet Richard, our new Engineering Placement Student Hyperdrive win SME Company of the Year 2020 St Benedict’s Hospice named as Hyperdrive’s Charity of the Year 2020 Business Continuity in Response to COVID-19 Careers Senior Project Controller Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/another-record-year-for-hyperdrive": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > Blog > Looking forward to 2020 Looking forward to 2020 Blog 9th December, 2019 This year, we've helped more customers get their new electric products to market and as a result have received global recognition. Here we reflect on 2019 highlights and look forward to exciting new developments. Best of the Year Welcome to HYVE In July this year we opened the doors to HYVE, the UK’s largest independent battery pack manufacturing facility, at our HQ site in Sunderland. With the capacity to manufacture up to 30,000 batteries a year, the launch of the 21,000 square foot facility enables us to supply some of the world’s largest brands with our high performance battery systems. The Sunday Times Tech Track 100 Ranking 40th in the Sunday Times Tech Track 100, the internationally recognised list ranks the top 100 private tech firms in Britain. Sitting alongside huge tech companies such as Dyson, JCB, McLaren and Virgin, it’s been a huge achievement for Team Hyperdrive. JCB’s Mini-Excavator Supplying our modular battery pack to power JCB’s first all-electric mini-excavator, it was a fantastic moment to witness the E-TEC 19E win the world famous Dewar Trophy. One of the most revered awards in British Engineering, the project was recognized as an ‘Outstanding British Technical Achievement in the Automotive Industry’. Snorkel’s Fully Electric Speed Level Celebrating Snorkel Lift’s 60th Anniversary , we’ve partnered with them to power and bring to the market their first lithium-ion powered Sigma Lift. Previewed at Bauma, the world’s largest construction show, the new zero-emission SL26RTE and SL30RTE models reduce running costs by up to 95% and are now in volume manufacture. Our 2020 Vision Looking ahead, we are determined to continue our history of innovation and bring industry leading solutions to our customers. Here’s a first look at what we’ve got planned: HY-Energy Plus Peak Available in the first quarter of 2020, our new HY Energy Plus Peak Battery Pack allows for a higher peak current over a longer time period. With the first production prototypes on their way to customers, we expect to formally launch the new product early in the new year. Sign up here to be among the first to receive the datasheet for our High Current pack. Climate Control In development, our climate controlled pack is our first battery pack to feature active thermal management. Cooling the battery when it’s warm, and warming the battery when it’s cold, our battery technology keeps the battery at an optimal temperature to achieve the very best performance. Sign up here register interest in our Climate pack. Get in touch We are passionate about helping our customers achieve their electrification goals. If you’re interested in catching up about our latest battery developments, or want to know how we can help, get in touch with Steve or Tom at the email addresses below. Steve Abbott: steve.abbott@hyperdriveinnovation.com Tom Hill: tom.hill@hyperdriveinnovation.com Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/un-safety-testing": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > UN Safety Testing UN Safety Testing Name of cell, battery, or product manufacturer, as applicable: HY Energy Pack Range Cell manufacturer’s contact information: Envision AESC UK Ltd Washington Road Sunderland Tyne & Wear SR5 3NS UK Pack manufacturer’s contact information: Hyperdrive Innovation Ltd Future Technology Centre Barmston Court Nissan Way Sunderland Tyne and Wear SR5 3NY UK Name of the test laboratory: Alpha tech Environmental test laboratory Green house Homefield Road Ind Est Haverhill Suffolk CB9 8QP A unique test report identification number: HYP-00-2890 Test report number 103420 Date 11 July 2018 HYP-00-2889 See above test number HYP-00-2798 Test report number 103563 Date 14 February 2019 Date of test report: See above Description of cell or battery: o Lithium ion or lithium metal cell or battery: Lithium Ion o Mass: 32kg and 37kg o Watt-hour rating or lithium content: See data sheet o Physical description of the cell/battery: See data sheet o Model numbers: See data sheet List of tests conducted and results: Test: ST/SG/AC10/11/Rev6 reference: Result Sinusoidal Vibration Section 38.3.4.3: Test T3 Pass Shock Section 38.3.4.3: Test T4 Pass External Short Section 38.3.4.3: Test T5 Pass 44V Test Report 52V Test Report Reference to assembled battery testing requirements: See above Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/the-5-steps-to-electrification": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > Blog > The 5 Steps to Electrification The 5 Steps to Electrification Blog 2nd April, 2019 As the European Union (EU) Stage 5 engine regulations come into force and an ever-growing number of UK cities seek to mitigate air pollution through the use of low emissions zones (LEZ), the impact of pollution from non-road mobile machinery (NRMM) is coming into sharp focus. The legislative net has been tightening around the automotive industry’s emissions standards for many years now – and it’s been well publicised. We’re all now very familiar with the concept of the London congestion charge and catalytic converters on our diesel cars. However, one sector that’s so avoided the lime light is NRMM – everything from agricultural machinery, construction, building material machinery, industrial trucks, cranes and even inland waterway vessels. Now, just like the auto industry, NRMM is undergoing a profound change, driven by legislation. What are EU Stage 5 Regulations? As of 1 January 2019, all new machines which fall within the scope of NRMM have had to comply with new emissions standards; Euro-Stage 5. This means that for the first time, all engines with a power range up to 560 kW are included in EU emissions legislation. The purpose? To further reduce the levels of particulate matter (PM) produced by internal combustion engines (ICE). So, weather someone is working in a warehouse that uses diesel forklifts, ploughing the fields in a tractor or simply walking past a construction site using ICE excavators and generators, the air they breathe should be much cleaner as a result. For those using ICE engines, there’s no getting around the fact you will have to comply. All combustion engines, whether they’re petrol, diesel, gas, or anything else are included, and it applies equally to both variable-speed and constant-speed engines. Are you ready for EU Stage 5 Regulations? Euro Stage 5 engine regulations are injecting urgency into the vast number of industries using NRMM. They are keen to not just comply with current regulations but also get ahead of the curve and protect their businesses against future, tougher regulations. Traditional OEMs, factory managers, construction companies and virtually every other sector that requires powertrains, are now, therefore, embroiled in a race. A race to slash emissions. A race to electrify. This may sound like a daunting task – especially at a time of ever tightening budgets, when R&D into new and effective drive chains can come at large expense. However, without electrifying, these businesses could face the prospect of installing expensive engine after-treatment to comply. In some cases, this could add 50-100% to the cost of machinery. With you at every stage That’s where we can help. By offering a spade-ready, bespoke and affordable alternative that’s zero emissions, future proof and trusted by household brands, we can be your electrification partner to navigate you through the rapidly changing legislative landscape. Not only does this save many years and potentially huge sums of money on inhouse R&D, but by making the speedy transition to electrification, you can begin to see other savings such as lowered maintenance and fuel costs almost immediately. Not only that, going electric has multiple benefits for your customers, from improved operator comfort, reduced noise pollution, and enabling 24/7 operations in city centres, residential areas, near schools and hospitals with zero disruption. Do you need to get ahead of the curve? Here’s our 5 steps to electrification… Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/japan": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Hyperdrive Japan Hyperdrive Japan 高性能エネルギーシステム Hyperdriveは、電気自動車、家庭および企業を動かす革新的な技術を開発しています。化石燃料に代わるクリーンエネルギーを市場に導入し、国内外のブランドと協力して、都心部、建設現場、および輸送拠点で自動車に電力を供給しています。 私たちはEnvision AESCリチウムイオンバッテリー技術を自社の商用製品に提供した最初の会社であり、私たちを技術進歩の最前線に置く重要な知的財産を持っています。 エキスパートデザイン 業界をリードするLi-ionセル化学と実証済みのバッテリ管理技術ををまとめあげることにより、当社は、製品の市場での成功に不可欠な性能とパッケージングを応用したパッケージ化を可能にしました。 設計と開発においては、プロジェクトの開始時から、機械、電子、およびファームウェアの専門家と共に業務を進めるシステムインテグレータを含んで社内一括で取り組んでおります。当社のエンジニアは、幅広い分野の洞察力と専門知識を持ち、超小型エネルギーストレージ、スマートコントロール、統合、低コストを実現するソリューションを各アプリケーションに最適化することができます。 反応性のある製造 生産設計は、当社の業務の中核を成しています。試作段階では、社内の製造チームがプロセスをリードし、お客様を連産品生産へ導きます。 当社の技術機能と継ぎ目なく連結しているこの社内能力により、皮切りの試作品構築、そして実験的生産、さらには量産供給へ付加価値を提供し続けます。 業界をリードする技術を基盤に、標準技術プラットフォームを導入することで、生産要件に対し高反応な対応が可能になります。急速に拡大化する能力をを備えているため、車載電化やバッテリ・エネルギー貯蔵の統合システムを探しているお客様の商業化への迅速な対応が可能です。 Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/careers/senior-project-controller": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Careers > Senior Project Controller Senior Project Controller Hyperdrive Innovation, based at the Future Technology Centre in Sunderland, is a growing technology and manufacturing business with a track record of developing and integrating innovative Lithium-ion battery systems for electric and hybrid electric powered vehicles and energy storage systems. Our products feature in the off-highway, energy storage, marine, AGV and transport sectors with all development, production and integration undertaken by Hyperdrive in the UK. Our energy system solutions incorporate our in-house developed Battery Management System (BMS). With a global blue-chip customer base, the Company operates within a sector which is cutting edge, dynamic, fast moving and quick changing. It is a multi-award-winning business, featuring in the Sunday Times as one of the “Fastest growing 100 companies in the UK” and continually “punches above its weight”. In return for a competitive benefits package, the Senior Project Controller will need to feel confident in this fluid environment, whilst being responsible for, and carrying out, the following duties: Projects Assist in the definition of project scope and objectives. Translate project scope and requirements into scheduled tasks. Manage and work with the project stakeholders to keep the project on schedule. Communicate with internal departments, customers and suppliers. Arrange and take the lead in meetings to keep project on schedule. Relay any project issues to PM in a timely manner. Create and maintain project documentation. Collate project performance data, including expenditure. Take the lead on project performance reviews (Lessons Learnt). Liaise with operations on handover of project deliverables and close project and documentation. Customer APQP documentation coordination and delivery. Change Control DCC (Design Change Control), control and lead. Manage the BOM / Adoption of new / modified parts onto EMAX (MRP) system Supplier Management of new part introduction. Production Planning Production planning, customer orders (sales), develop weekly plan including reworks and repairs. Support with the integration of EMAX system. Qualifications / Experience A minimum of 3 years’ experience working in a similar role with Project Management, Change Control, APQP, Supplier Management and Production Planning capabilities. You will be confident, self-motivated and process driven and be able to work with the dynamics of cross functional departments, as well as autonomously, to achieve successful outcomes for the customer and wider business. Excellent written, verbal and IT communication skills will be evident in your work, as will the attention to detail, the ability to multi-task, lead meetings and being able to work under pressure in a busy environment. You should show a willingness and enthusiasm to acquire information and knowledge through self-development and learning from others whilst sharing your own knowledge and experience with the team. A manufacturing background with experience of ERP systems would be beneficial as would an interest in technology. To apply for this role, please send your CV, together with a covering letter summarising your suitability and stating your current salary to Brenda.Roberts@hyperdriveinnovation.com no later than Friday 1 May 2020. NO AGENCIES Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/hyperdrive-awarded-battery-supply-contract-for-snorkels-ndustry-leading-zero-emission-speed-level": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > Hyperdrive awarded battery supply contract for Snorkel’s industry leading zero emission Speed Level Hyperdrive awarded battery supply contract for Snorkel’s industry leading zero emission Speed Level News 13th November, 2019 Snorkel’s battery powered mobile elevating work platform cuts running costs by up to 95% over existing diesel engine models. Hyperdrive Innovation, developer and manufacturer of lithium-ion battery technology, has collaborated with Snorkel, one of the world’s largest Mobile Elevating Work Platform (MEWP) manufacturers, to develop a fully electric Speed Level. The new zero emission SL26RTE and SL30RTE models from Snorkel complement the company’s already impressive range of electrified lifts and was unveiled for the first time at Bauma earlier this year, the world’s leading construction machinery trade show with over 580,000 visitors from around the world. Approximately half of Snorkel’s product line of 52 lifts are electrically powered, using lead acid battery technology. In contrast, the new SL26RTE and SL30RTE models are kitted out with a 17kWh Hyperdrive lithium-ion battery pack – made in Sunderland, UK. Utilising industry leading lithium-ion battery technology means the Speed Levels will deliver extended duty cycles for longer, continuous operation. Lithium-ion batteries are also shown to last up to 20 times longer than lead acid batteries. The use of maintenance free lithium-ion battery packs reduces running costs by up to 95% when compared to the combustion engine alternative. They also deliver increased operator comfort with significantly less noise, making the new SL26RTE and SL30RTE 60% quieter than the existing Snorkel SL26SL – which is already an industry leader. The low voltage system is also easily serviced, without the need for specialist high voltage training, and has been tested in climatic chambers between -25°C and +60°C. This bold partnership comes as Hyperdrive prepares to triple UK manufacturing capability in response to significant national and international growth. Stephen Irish, Commercial Director at Hyperdrive commented, “It’s been fantastic to partner with Snorkel on their first lithium-ion battery powered machine. To have the opportunity to collaborate with another progressive and forward-thinking business that is at the forefront of their industry is testament to our capabilities and a great example of the wave of clean growth being driven by changing legislation internationally.” We are delighted to secure the contract to supply the SL26RTE and SL30RTE with the very latest Hyperdrive battery technology and working to a demanding timeline, it has been a pleasure to support Snorkel to take the initial concept vehicle through its development cycle and into production.” John Gill, Chief Manufacturing Officer at Snorkel commented, “We are pleased to have signed an official supply agreement with Hyperdrive Innovation, with whom Snorkel has worked closely with to develop a stable electric powerchain that can deliver the reliability and performance that our customers require. Following very positive feedback to our preview at Bauma, the design has undergone thorough testing, both in concept and in field evaluations, and we are confident that these models will exceed our customers’ expectations.” Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/industries": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Industries Industries Download Technical Data Sheet Download Product Range Brochure We’ve been partnering with Original Equipment Manufacturers since 2012. We understand that businesses are currently facing challenges from EU Stage 5 engine legislation, specifically through the urgency to electrify and the technical uncertainties of new product development. As a trusted electrification partner, we’re fully committed to navigating you through this rapidly changing landscape and providing the necessary support at every stage. Off-Highway From exhaust emissions to noise reduction, the global Off-Highway industry is facing increasing pressure to electrify. Our industry leading lithium-ion battery packs are perfectly suited to a wide range of vehicles and machines. Read more Material Handling To comply with new emission regulations, the Material Handling industry is rapidly introducing more sustainable business practices through the adoption of zero-emission products. Our lithium-ion battery packs are the perfect solution for highly operational applications with minimum downtime. Read more Stationary Energy Storage Residential and Commercial battery storage is revolutionising the global energy landscape. Used in conjunction with solar panels or as a stand-alone installation, our lithium-ion battery packs reduce your carbon footprint and provide protection from fluctuating energy costs. Read more Portable Energy Storage For remote locations, events and emergency response, connecting to the grid isn’t always an option. Our lithium-ion battery packs provide increased cost savings, reduced CO2 and pollution emissions whilst delivering reliable power on the go. Read more Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/the-geopolitics-of-funding-battery-technologies": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > Blog > The global race to fund battery technology The global race to fund battery technology Blog 10th October, 2018 The global battery market is expected to grow by nearly $50 billion a year over the next decade as the demand for electric vehicles grows and the need to switch to clean energy sources increases. Battery technology will play a vital role in powering the cars and storing the energy, that for example, wind turbines or solar panels produce. More and more homes and buildings will be upgraded to incorporate energy storage facilities. The battery industry has to respond to this demand. More research and development is required to reach the increased requirements for a greater range for electric vehicles, or the ability to produce cells cheaper to reduce costs. To deliver this, battery technology firms which are at the forefront of innovation need continued access to capital. More importantly, patient capital which understands that while the revolution is underway, until the technology scales and consumer and business demand peaks, returns maybe some time away. The potential, however, is enormous. The UK is one of the world leaders in battery technology, and it is vital that it remains at the forefront in the face of considerable global competition. The north east is already a world-class hub with car manufacturers like Nissan working closely with local universities and businesses, like Hyperdrive Innovation to develop the latest in battery technology. We have received support from Government agencies like Innovate UK and the Advanced Propulsion Centre and recently set up a manufacturing partnership in Asia to help meet the demand for our technology. We are ambitious to do more, but the competition is fierce. Around the world, governments are pouring funds into the industry. For example, Australia’s Government is investing more than $200 million. In the UK, the Government set up the Faraday Challenge – a £246 million commitment until 2021 for battery development. The Faraday Challenge has been very successful, and Hyperdrive has benefitted from funding for some projects. However, it backs only a finite number of projects and is time-limited. One of the frustrations from an SME perspective is that the application process can prove very time consuming, a constraint on available resources and at times, expensive. Government funding is one thing, but there also needs to be private sources of capital. When you consider that China has a battery manufacturer, CLS, worth more than £11.5 billion, than the scale of the competition is evident. Recently Gore Street Energy Storage, an investment company striving to be the UK’s first listed ‘battery’ fund, cut its fund-raising target to £35 million from £100 million. Restrained Government funding makes private sources more critical. For the UK to remain competitive, we need to look at ensuring that the industry can rely on long-term sources of funding. It would be great to understand what the Government’s plans for the sector are, especially post-Brexit and are there ways, perhaps through the tax system to encourage more private capital into the industry? Britain is a world leader in battery technology, and there is an opportunity for businesses to scale to become global players. It is essential that companies, governments and investors plan and work together to make sure we continue to compete on the world stage. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/business-continuity-in-response-to-covid-19": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > Business Continuity in Response to COVID-19 Business Continuity in Response to COVID-19 News 19th March, 2020 A note from Hyperdrive CEO, Chris Pennison, regarding business continuity in response to COVID-19 Dear all, In light of the COVID–19 outbreak I would like to take this opportunity to wish you all well and reassure you that we are making the best possible efforts to minimise interruption whilst protecting the health and safety of our employees and stakeholders. We will continue to monitor and review the situation on a day-to-day basis, and will announce any changes as they emerge, but the latest is as follows: Production in HYVE UK will continue as normal and stock parts are as planned so we do not currently have issues fulfilling customer orders. Where possible, employees that can are working from home and are available by email and mobile telephone. Hyperdrive will not be accepting any visitors to our premises until further notice. All in-person meetings will be replaced with phone calls or video conferences where possible. Only essential travel to customer sites by Hyperdrive employees is permitted and will be assessed on a case by case basis. We understand that everyone is feeling the effect of COVID-19, but where possible, we politely request that customers please share any changes in your schedule and/or requirements as soon as possible in order to allow us to plan accordingly. Please inform your usual contact of any changes or new requirements or respond via the info@hyperdriveinnovation.com email address and we will respond to you straight away. We will continue to keep you all updated and welcome any feedback or questions you may have. Yours Sincerely, Chris Pennison CEO Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/industries/off-highway": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Industries > Off-Highway Off-Highway From exhaust emissions to noise reduction, the global Off-Highway industry is facing increasing pressure to electrify. Our industry leading lithium-ion battery packs are perfectly suited to a wide range of vehicles and machines. Construction, Agricultural and Mining machinery As European Union Stage 5 engine regulations come into force and an ever-growing number of international cities bring in low emission zones, the impact of pollution from the construction industry is in sharp focus. Read more Airport Ground Service Equipment (GSE) Air and noise pollution at airports around the world are of key concern for authorities, businesses and passengers alike. With aviation operations under heavy scrutiny by various airport commissions, there’s now a particular focus on ground support equipment (GSE). Read more Mobile Elevating Work Platform Battery powered material handling equipment such as scissor lifts, cherry pickers, forklift trucks, sigma lifts and work aerial platforms are growing in popularity due to the multiple benefits they provide to the end user. Read more Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/our-community": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Our Community Our Community Charity of the year We’re proud to support our local community and every year we partner with a small local charity to give something back. We undertake all sorts of fundraising challenges, from running marathons to bake off’s and even leg waxing. Everyone is encouraged to join in and our CEO and Board of Directors get equally involved. About St Benedict’s Hospice Established in 1984, St Benedict’s Hospice provides specialist palliative care to the people of Sunderland and surrounding districts. As the only dedicated hospice to serve the City of Sunderland, it’s estimated that at any one time, they have approximately 300 patients using their services. STEM Days We believe in inspiring the next generation of engineers. From our HQ in Sunderland, we’re proud to host STEM Days for local schools where children can meet our team across all disciplines and learn first hand what a career in Technology, Engineering and Manufacturing looks like. We’re also a key supporter of Bring it On , the north east’s leading educational event that inspires and motivates school children of all ages into engineering careers. Taking place every year, the event coincides with the Big Bang Fair, a national science competition with a regional round. Lithium-ion Battery Recycling We’re very proud to make conscious business efforts to reduce our amount of waste. Through implementing coherent processes, our plastic, metal and paper waste from our Sunderland site is fully recycled. As a producer of industrial batteries under the Waste Batteries and Accumulators Regulations 2009, we also take back free of charge, waste industrial batteries supplied to our customers for treatment and recycling. If any of our customers or in certain cases other end users, require us to take back batteries, contact us at recycle@hyperdriveinnovation.com . We will agree the necessary arrangements for the return, proper treatment and recycling of the waste industrial batteries. Carbon Capture Certified We make sure to capture the carbon emitted by the production, manufacture, and distribution of our print through Northern Print Solutions . The amount of CO2 generated during this process is calculated, and the figures are passed onto the Woodland Trust along with the Carbon Capture surcharge, which pays for the plantation of new, native UK woodland by the Woodland Trust across our region. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/industries/material-handling": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Industries > Material Handling Material Handling To comply with new emission regulations, the Material Handling industry is rapidly introducing more sustainable business practices through the adoption of zero-emission products. Our lithium-ion battery packs are the perfect solution for highly operational applications with minimum downtime. Warehouse Vehicles With European Union (EU) Stage 5 regulations now in force, all new Internal Combustion Engine (ICE) for material handling equipment and non-road mobile machinery (NRMM) with a power range up to 560 kW have to comply with new emission standards. Read more Autonomous Guided Vehicles (AGVs) Ideally suited to logistics and warehousing environments, AGVS are transforming the way materials are moved, stock is located, and orders picked without disturbing production. As global demand for AGVs increase, and more reliable power is needed to run them, there is now a progressive switch from lead acid to lithium-ion batteries. Read more Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/hyperdrive-in-conversation-with-ian-ellerington-head-of-technology-and-transfer-at-the-faraday-institution": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > Blog > Hyperdrive in conversation with… Ian Ellerington, Head of Technology and Transfer at The Faraday Institution Hyperdrive in conversation with… Ian Ellerington, Head of Technology and Transfer at The Faraday Institution Blog 14th January, 2019 We caught up with Ian Ellerington, Head of Technology and Transfer at the Faraday Institution to learn why now is such an important time for UK industry to be improving battery technology, and what he thinks the future EV landscape will look like in just 10 years time. “The speed that battery technology is improving is going to influence the speed of the uptake of electric vehicles and it’s really important for the UK to be taking lead on this.” https://hyperdriveinnovation.com/hd/wp-content/uploads/2019/01/Ian-Ellerington-The-Faraday-Instituion-final.mp3 Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more High Performance Battery Energy Storage Systems Hyperdrive Innovation designs, develops and manufactures lithium ion battery systems. As a trusted electrification partner to original equipment manufacturers around the world, our battery technology is present in a diverse range of applications, providing our customers with the right energy at the right time. About Hyperdrive Innovation Language select: 普通话 日本語 Our battery energy storage solution Modular product range With a standardised design, our modular product range provides a flexible and scalable battery energy storage solution. Combining a high-performance lithium-ion NMC battery pack with a built in Battery Management System (BMS) our intelligent systems are designed for rapid deployment and volume manufacture, supplying you with class leading energy density and performance. Fast and efficient charging High voltage Easy fitting and installation Integrated Charger Controls Access to World-class Battery Cell Technology Proven automotive quality and global high volume supply UN38.3 Certified Approved for global shipping Versatile Scale up capacity without additional controllers High Voltage Connect modular packs in series for systems up to 630V Environmental Protection IP55 Our Industries Our lithium-ion battery packs are designed for a wide range of applications. Their modular design enables universal deployment across multiple industries. Off-Highway Material Handling Stationary Energy Storage Portable Energy Storage Our Approach Design We partner with you from initial concept stage and outline key characteristics and technical requirements. Supporting you through any problem solving, we provide expert guidance and knowhow to design robust application schematics. Develop We can support your product development, testing duty cycles and working alongside your engineering team from prototype through validation. Large projects will benefit from a dedicated project manager and a specialist systems integrations team. Manufacture As the UK’s leading independent battery manufacturing facility our 9,000 square foot factory is well equipped to meet your volume requirements. With a specialist production team and dedicated quality management unit, we maintain operational excellence and product assurance. Insights News 19th March, 2020 Business Continuity in Response to COVID-19 Read post News 3rd March, 2020 St Benedict’s Hospice named as Hyperdrive’s Charity of the Year 2020 Read post News 24th February, 2020 Hyperdrive win SME Company of the Year 2020 Read post Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/hyve-manufacturing": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > HYVE Manufacturing HYVE Manufacturing From HYVE, our purpose built UK site, we manufacture both our standard modular battery pack design and bespoke pack designs for customers. Following automotive production guidelines, each battery is cycled and tested before being despatched to our UK and European customers. 9,000 square foot facility 30,000 build pack capacity 173 MWh output Semi-automated production lines We utilise self checking torque equipment, bespoke assembly fixtures and jigs, assembly software, in-line process checks and digital data records. Cycle stations Using our 100% end of line cycle process we ensure each battery’s vital functions are operating correctly. Quality control cells We offer supplier warranty, in-coming part verification, in-process controls and end of line 100% battery cycle to ensure quality is an integral part of our battery packs. Quality assurance Following our right first time philosophy, both defect prevention and defect detection are built into the procedures and controls that govern our manufacturing process. Team Our skilled manufacturing team bring with them many years experience from the Automotive, Rail, Pharmaceutical & Aerospace industries. Through our robust internal training programme, they maintain product efficiency and quality. Our Accreditations Quality Quality is a key focus of our business practice and we’re committed to creating a culture of continuous improvement. Displaying the International Quality Management Standard, we consistently provide products that meet customer and regulatory requirements. Environmental We’re proud to hold the International Standard for Environmental Management Systems, displaying our proven capability of reducing our resource use, improving the overall efficiency of our business and keeping the larger impact of our operations to an absolute minimum. HYVE Asia We have an international manufacturing facility in Taiwan to cater to the growing Asian market through our strategic partner, Foxlink Automotive Group. Under our Intellectual Property licensing, Foxlink manufacture, sell and distribute our modular product range to customers across Japan and China. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/page/2": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Blog Blog Page: 2 All Blog Events News Blog 23rd July, 2018 5 minutes with Dr David Sandells Read post Blog 23rd May, 2018 Why the push for electric vehicles may be sooner than you think… Read post Blog 26th October, 2017 Top 5 New Electric Vehicle Trends Read post Blog 28th July, 2017 Energy Independence: UK Legislation and Investment Drives Change Read post Blog 20th April, 2017 V2G: The role for EVs in future energy supply and demand Read post Blog 3rd February, 2017 Driverless electric vehicles, delivering your shopping and powering your home Read post ← 1 2 Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/hyperdrive-win-energy-innovation-award": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > Hyperdrive win Energy Innovation Award Hyperdrive win Energy Innovation Award News 29th November, 2019 Hyperdrive has won the Energy Innovation Award at the 2019 North East Innovation Awards. The Energy Innovation award recognises businesses that are positively impacting the environment and sustainability by changing the way we view and use energy. The award ceremony took place on Thursday 28th November 2019 at St James Park as part of VentureFest North East , the leading showcase event for innovative companies. Dr Dave Sandells, Technology Director, commented “It’s a great achievement to be recognised for our commitment to clean energy. Our battery technology is designed and developed here in the north east and can be found in applications all over the world. The Innovation Awards are a fantastic opportunity to celebrate those companies in our region that are pushing boundaries and paving new ways.” As part of the wider Innovation SuperNetwork programme, the event was delivered by 60 partner organisations and supported by the North East LEP, Northumbrian Water, ENGIE and the North East BIC. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/page/10": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > News News Page: 10 All Blog Events News News 11th February, 2014 Hyperdrive Innovation achieves 300% growth Read post News 4th February, 2014 C-Enduro at the Maritime Showcase Read post News 30th January, 2014 Hyperdrive Innovation on the up Read post News 18th December, 2013 Trials get underway for unmanned sea vessel Read post News 17th December, 2013 Hyperdrive Delivers Cue-V as Part of £25m Programme Read post News 17th December, 2013 BMS developed for Jonny Smith flux capacitor Read post News 10th December, 2013 Hyperdrive Innovation lights up Lumiere Festival Read post News 5th December, 2013 Integrated electronic systems developed for ASV Read post ← 1 2 3 … 7 8 9 10 Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/battery-energy-storage": "Translated: SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights Insights Blog Events News News 19th March, 2020 Business Continuity in Response to COVID-19 Read post News 3rd March, 2020 St Benedict’s Hospice named as Hyperdrive’s Charity of the Year 2020 Read post News 24th February, 2020 Hyperdrive win SME Company of the Year 2020 Read post Blog 13th February, 2020 Meet Richard, our new Engineering Placement Student Read post News 31st January, 2020 Celebrating our Charity of the Year 2019 Read post News 23rd January, 2020 Hyperdrive partners with RS Sailing to power industry disrupting electric boat Read post Blog 9th December, 2019 Looking forward to 2020 Read post News 29th November, 2019 Hyperdrive win Energy Innovation Award Read post News 13th November, 2019 Hyperdrive awarded battery supply contract for Snorkel’s industry leading zero emission Speed Level Read post 1 2 3 4 … 10 11 12 → Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/events": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Events Events All Blog Events News Events 1st August, 2019 What to expect from IMHX 2019 Read post Events 24th July, 2019 See you at Cenex Low Carbon Vehicle Event 2019! Read post Events 9th December, 2016 CENEX LCV – 6th-7th September 2017 Read post Events 9th December, 2016 EES Europe – 30th May – 2nd June 2017 Read post Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/careers": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Careers Careers If you have a passion for innovation and technology, we want you to be part of our journey. As a newly qualified graduate or an experienced individual, you will be part of a team that is dedicated to providing our customers with the right energy at the right time. Working on exciting innovative projects for high profile companies, your working day will be diverse and highly rewarding. What we offer: Flexible working hours 25 days holiday + bank holidays Pension scheme Free on site parking Cycle to work scheme Health & Wellbeing programme Check out our vacancies and apply today careers@hyperdriveinnovation.com Current Vacancies Senior Project Controller Hyperdrive Innovation, based at the Future Technology Centre in Sunderland, is a growing technology and manufacturing business with a track record of developing and integrating innovative Lithium-ion battery systems for electric and hybrid electric powered vehicles and energy storage… Find out more We Are Team Hyperdrive Our ability to deliver industry leading energy storage solutions to some of the world’s largest brands starts with our team of experts. We come from a diverse range of industries and as unique as we are as individuals, we all share a mutual passion for technology and providing unrivalled quality to our customers. Life at Hyperdrive HQ We offer an engaging environment where your talent and skill set will be driving change. Innovation is core to what we do and runs through each part of the business. Not only that, we have a jam packed social events, charity fundraising and health and wellbeing calendar to make work more rewarding. We celebrate our birthday every year with a pizza party and unlimited cake, and have quarterly socials. See more of our charity efforts Our Focus Customer Centric We're proud to put our customers at the core of what we do. Market Leading Offer Our patented technology and industry leading products ensure our customers receive industry leading solutions. Reputation For Quality Providing our customers with proven automotive quality, we strive to be the best. Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/hyperdrive-in-conversation-with-ian-constance-ceo-at-the-advanced-propulsion-centre": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > Blog > Hyperdrive in conversation with.. Ian Constance, CEO at the Advanced Propulsion Centre Hyperdrive in conversation with.. Ian Constance, CEO at the Advanced Propulsion Centre Blog 18th September, 2018 Last week at Cenex LCV, the UK’s premier low carbon vehicle show, we caught up with Ian Constance, CEO at the APC, to talk about the future of electric vehicles in the UK and further afield. “The UK has always been a place of invention, of innovation and developing bright ideas and getting those ideas beyond paper.” https://hyperdriveinnovation.com/hd/wp-content/uploads/2018/09/IAN-APC3-v2.wav Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/hyperdrive-raises-vital-funds-for-4louis": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > Celebrating our Charity of the Year 2019 Celebrating our Charity of the Year 2019 News 31st January, 2020 Team Hyperdrive has successfully raised £4,820 of vital funds for 4Louis. Throughout the partnership Hyperdrive has taken part in a wide range of fundraising activities, from tuck shops to leg waxes, bake off’s to sporting events. In addition, the Board of Directors has kindly matched employee efforts, doubling the total amount raised. Based in Sunderland, 4Louis supports families in the north east and across the UK who have been affected by miscarriage, stillbirth and the loss of a baby or child. Hyperdrive’s donation will help 160 families with bereavement support, memory boxes and ongoing care. It will additionally provide specialist equipment and training to NHS units, hospitals and hospices who comfort grieving families. Read more about 4Louis and their fantastic work here: https://4louis.co.uk/ Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/the-female-university-student-trailblazing-the-world-of-engineering": "Translated: the list goes on. Where I end up in 5 years-time is a mystery, but I aim to be a well-respected engineer working to develop technology which allows humans to co-exist alongside nature and complement it rather than destroy it. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Blog Blog All Blog Events News Blog 13th February, 2020 Meet Richard, our new Engineering Placement Student Read post Blog 9th December, 2019 Looking forward to 2020 Read post Blog 13th August, 2019 The female university student trailblazing the world of engineering Read post Blog 17th April, 2019 Our top electric finds at bauma Read post Blog 2nd April, 2019 The 5 Steps to Electrification Read post Blog 14th January, 2019 Hyperdrive in conversation with… Ian Ellerington, Head of Technology and Transfer at The Faraday Institution Read post Blog 5th November, 2018 Hyperdrive in conversation with… Paul Butler, CEO at the North East Automotive Alliance Read post Blog 10th October, 2018 The global race to fund battery technology Read post Blog 18th September, 2018 Hyperdrive in conversation with.. Ian Constance, CEO at the Advanced Propulsion Centre Read post 1 2 → Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/technology": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Technology Technology Download Technical Data Sheet Download Product Range Brochure History of Innovation Research and development is core to our success. We’ve been innovating since our establishment in 2012 and we’re very proud of our patented technology. Our Intellectual Property has enabled us to create an industry leading lithium-ion battery pack that is modular, flexible and scalable, providing our customers with the right energy at the right time. Our International IP Patents: Battery Pack design Battery Management System (BMS) Assembly methodology Pioneering Battery Technology Our industry leading battery systems are powered by lithium-ion nickel manganese cobalt (NMC). As our chemistry of choice, Li-Ion NMC has unrivalled advantages over other battery types: High energy density enabling more power in less space Zero maintenance with no scheduled cycling required to prolong battery life Wide operating temperatures from -25 to +60 degrees Celsius Our Cells Stacked with a positive electrode and a negative electrode and laminated together, our cells have a compact yet large capacity. Heat dissipation is good, due to the laminate structure with a large surface area. Our Modules Containing 8 cells connected and housed in a metal case, the cells are protected from vibrations and boast automotive quality approved, tested and supplied by Envision AESC. Our BMS Each Hyperdrive battery pack comes with a built in Battery Management System (BMS). By providing real time Voltage, Temperature, Current and State of Charge (SOC) measurements it protects the battery pack by monitoring vital functionalities. Prepared for Extreme Environments Lithium-ion cell chemistry is sensitive to both high and low temperatures, and extreme climates can affect power, efficiency, capacity and charge as well as safety and reliability of the battery pack. In these scenarios it’s important to regulate the pack to remain in the desired temperature range, as well as reducing uneven temperature distributions to enhance performance and life cycle. For extreme environments Hyperdrive is supporting customers on system design and is developing new products incorporating air cooling and climatic control. We can also run duty cycle simulations at different ambient temperatures and advise customers on the most appropriate solution. Please contact Hyperdrive to discuss your specific requirements. Download our air cooled pack data sheet Increased life of battery Ability to work in extreme climates Higher charge and discharge rates High Energy Density Battery Pack The HEDB project was funded through the Advanced Propulsion Centre (APC), a joint Government and automotive industry initiative to accelerate the development of low emission technology in the UK. The project, which completed in February 2018, saw Hyperdrive Innovation collaborate with Nissan, the University of Newcastle, Warwick Manufacturing Group and Zero Carbon Futures to develop a new manufacturing process at Nissan’s Sunderland plant, which allows the carmaker to produce 40kWh battery cells in the UK for European markets. For Hyperdrive, this has included the design of a new universal, modular energy storage system and installation of a pilot line for prototyping and pack assembly at Hyperdrive HQ Sunderland with a significant investment made in quality standards and developing the supply chain. Close Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/page/4": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > News News Page: 4 All Blog Events News News 27th June, 2018 Hyperdrive exhibit as part of the Great Exhibition of the North Read post News 18th June, 2018 Hyperdrive achieves ISO 14001:2015 Environmental Certification Read post News 22nd May, 2018 Hyperdrive Innovation to represent UK at major Japanese automotive conference Read post News 6th April, 2018 Hyperdrive sponsor local children’s football team Read post News 3rd April, 2018 Hyperdrive Innovation enters strategic partnership with Foxlink to expand into the Asia market Read post News 26th March, 2018 Hyperdrive place for a consecutive year in the Northern Tech Awards! Read post News 26th March, 2018 Hyperdrive celebrates 6th birthday with plans for expansion Read post News 22nd February, 2018 Hyperdrive celebrates successful completion of High Energy Density Battery Project Read post News 22nd February, 2018 Hyperdrive win at the North East Automotive Alliance Awards 2018 Read post ← 1 2 3 4 5 6 7 8 9 10 → Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/about": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more We Are Hyperdrive Home > About About Based in the north east of England within the UK’s principal location for advanced manufacturing, we have wide ranging experience in lithium-ion battery design, development and manufacture. Operating across a range of industries we have proven excellence in delivering solutions for some of the world’s largest brands and supporting the extensive requirements of new product development strategies. Our high-tech plant is the UK’s leading independent battery manufacturing facility with current capacity for up to 30,000 units per year. Close Our Mission Enabling the storage and use of the RIGHT energy at the RIGHT time Our History 2019 Expanded our UK facility to double our manufacturing capacity, increasing our global footprint with partners in Asia and the US 2018 Manufactured our 5,000th battery pack with plans to double production in 2019 2017 Supply agreement with JCB, one of the world’s largest construction machinery manufacturers 2016 £19m High Energy Density Battery Project in collaboration with Nissan & APC 2015 Power system design & build for the world’s largest online grocery retailer 2014 Moved to our dedicated 17,000 sq. ft development & manufacturing facility 2013 Powertrain and battery pack design for Autonomous Survey fleet 2012 Light-weighting the Electric Quadricycle Our Approach Design We partner with you from initial concept stage and outline key characteristics and technical requirements. Supporting you through any problem solving, we provide expert guidance and knowhow to design robust application schematics. Develop We can support your product development, testing duty cycles and working alongside your engineering team from prototype through validation. Large projects will benefit from a dedicated project manager and a specialist systems integrations team. Manufacture As the UK’s leading independent battery manufacturing facility our 9,000 square foot factory is well equipped to meet your volume requirements. With a specialist production team and dedicated quality management unit, we maintain operational excellence and product assurance. Our Executive Team Chris Pennison CEO Stephen Irish Commercial Director BEng, CEng, MIMechE Dr Dave Sandells Technical Director MBA, PhD Aidan Lannen Finance Director ACMA Our Non Executive Team Andrew Lapping Chairman Bim Sandhu Non Executive Director Tim Sale Non Executive Director Our Focus Customer Centric We're proud to put our customers at the core of what we do. Market Leading Offer As a technology developer we offer customers industry leading solutions. Reputation For Quality With a focus on high performance and high quality, we strive to be the best. Our Partners Collaborating to give our customers the right energy at the right time, our partners have worked with us to deliver more effective and successful projects. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/hyperdrive-in-conversation-with-paul-butler-ceo-at-the-north-east-automotive-alliance": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > Blog > Hyperdrive in conversation with… Paul Butler, CEO at the North East Automotive Alliance Hyperdrive in conversation with… Paul Butler, CEO at the North East Automotive Alliance Blog 5th November, 2018 We caught up with Paul Butler, CEO at the North East Automotive Alliance, the UK’s largest industry-led automotive cluster group, to talk about the future of automotive manufacturing in the north east. “The north east has a reputation for manufacturing excellence. There are over 240 automotive companies based here with a combined turnover of £11 billion, employing over 30,000 people.” https://hyperdriveinnovation.com/hd/wp-content/uploads/2018/11/Paul-Butler.mp3 Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/industries/stationary-energy-storage": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Industries > Stationary Energy Storage Stationary Energy Storage Residential and Commercial battery storage is revolutionising the global energy landscape. Used in conjunction with solar panels or as a stand-alone installation, our lithium-ion battery packs reduce your carbon footprint and provide protection from fluctuating energy costs. Home Energy Storage Home energy storage systems enable homeowners to store electricity from renewable energy sources such as solar PV, wind or hydro turbines for later use. Through minimising reliance on the grid, residential energy storage enables homeowners to enjoy greater convenience and flexibility, as well as peace of mind about their energy bills. Read more Commercial Energy Storage Changes to the National Grid’s regulatory framework is transforming the UK energy landscape. As of April 2019, the Electricity System Operator (ESO) became a legally separate company within the National Grid Group. Drivers such as decarbonisation, decentralisation and digitalisation have revolutionised the UK’s energy supply with a growing trend in battery energy storage. Read more Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/blog/meet-richard-our-new-placement-student": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > Blog > Meet Richard, our new Engineering Placement Student Meet Richard, our new Engineering Placement Student Blog 13th February, 2020 \"The start of this new decade will hopefully be looked back upon in the years to come as an inflection point in the journey to electrification.\" Currently studying a Masters in Electrical and Mechanical Engineering at Edinburgh University, Richard joins us for a 6 month industrial placement. Involved in a variety of projects including battery production improvements, IP testing and supply chain research, we caught up with him to learn more about his expected industry trends and ambitious plans for the future. What drew you to Engineering? Early years at school were essential for sparking my interest in Engineering. Much was made of the global issue of climate change and how the onus is on my generation to lead the transition to sustainable energy. Naturally, I was inspired to study engineering as a means of playing my part in this green technology revolution. What industry trends do you expect to see in the next 10 years? The start of this new decade will hopefully be looked back upon in the years to come as an inflection point in the journey to electrification. I expect to see the economic and engineering benefits of an electric motor coupled with lithium-ion batteries lead to accelerated reduction of market dominance of fossil-fuel powered devices in all but a few applications. Advances in power electronics, battery chemistries and manufacturing will make this case ever more compelling. What engineering problem do you hope to solve throughout your career? The problem I am most fascinated by is energy storage, hence I am delighted to be at Hyperdrive learning the fundamentals of battery systems design and manufacturing. There is no one size fits all solution to this problem, and each application has a specific technology that is best suited to it. I hope to contribute towards bringing individual consumers the ability to store their own electricity throughout my career. What are your goals for the next 5 years? My 5 year plan includes returning to University after this placement to complete my Masters in Electrical and Mechanical Engineering, followed by a Masters in Carbon Finance. With this skill set I hope to work on engineering projects, with a focus on economical viability. I hope to gain a place in a team as a graduate engineer within the green technology industry, as I work towards Engineering Chartership. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/hyperdrive-partners-with-rs-sailing-to-power-industry-disrupting-electric-boat": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > Hyperdrive partners with RS Sailing to power industry disrupting electric boat Hyperdrive partners with RS Sailing to power industry disrupting electric boat News 23rd January, 2020 RS Electric Boats, the new sister company to international maritime company RS Sailing, this week launched Pulse58 – the world’s first production Rigid Inflatable Boat (RIB) with a fully integral electric drive. The ground-breaking 5.8m electric RIB was unveiled at Boot Dusseldorf, the world’s leading water sports tradeshow. It is the product of 2 years of development, aimed at bringing cutting-edge zero emission automotive drivetrain technology to the mainstream maritime industry. Powered by ten Hyperdrive HY Energy plus battery packs that are stored in a purpose designed underfloor structural case, the industry disrupting model has a range of 35 nautical miles at its maximum speed of 20 knots. Stephen Irish, Commercial Director at Hyperdrive commented, “Tightening legislation, growing environmental concerns and rapidly falling battery costs are driving huge demand for electrification across multiple industries. It’s an exciting prospect to bring our expertise from already-established sectors into the maritime industry as it too looks towards a cleaner future. RS Electric Boats deserves huge credit for being the first to market with such an innovative forward-thinking product.” Pulse58’s sustainable construction comprises of Bio-based infused epoxy resin, recycled PET core material and naturally sourced basalt and flax fibres. These fibres are incredibly strong and energy absorbing. Experience gained in the sustainable construction of the successful RS Aero and RS21 sailboats has enabled RS to bring to market the most sustainable laminate of any RIB in the sector. This innovative laminate is lightweight – meaning improved range – and long lasting in even the most extreme environments. Alex Newton, CEO at RS Sailing, commented “ As a trusted electrification partner to original equipment manufacturers around the world, RS Electric Boats have partnered with Hyperdrive for the battery supply of the Pulse58, the first fully integral produced electric RIB. Hyperdrive’s ability to deliver innovative solutions has allowed us to develop a truly groundbreaking product that can redefine the marine industry.” Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/hyperdrive-win-manufacturer-of-the-year": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > Hyperdrive win Manufacturer of the Year 2019 Hyperdrive win Manufacturer of the Year 2019 News 23rd October, 2019 Hyperdrive has won Manufacturer of the Year (under £25m) at the Made in the North East Awards 2019. Sponsored by Barclays and Womble Bond Dickinson, the event showcases manufacturers that are producing world-class products in new and innovative ways. The Awards Dinner took place on Thursday 17th October at Hardwick Hall in County Durham with over 300 people in attendance. Chris Pennison, CEO, commented, “To win Manufacturer of the year is a huge achievement for our team after successfully launching HYVE earlier this year. We now have the capability to manufacture 30,000 battery packs per year and support global customers such as JCB, all from our site here in Sunderland. The Awards are a brilliant opportunity to celebrate the north east business community and showcase our talent on a national scale.” As a regional winner, Hyperdrive will automatically be enrolled into the Made in the UK Awards which will take place in Summer 2020. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news/hyperdrive-win-sme-company-of-the-year": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Insights > News > Hyperdrive win SME Company of the Year 2020 Hyperdrive win SME Company of the Year 2020 News 24th February, 2020 The Awards aim to celebrate some of the brightest talent and outstanding achievements of companies shaping the north east automotive industry. Hyperdrive has won SME Company of the Year at the North East Automotive Alliance Awards 2020. Recognised as a company who has demonstrated all-round achievement in the last 24 months, Hyperdrive has successfully overcome challenges to exceed their business objectives with future growth ambition. Stephen Irish, Commercial Director at Hyperdrive commented, “2019 has been a monumental year for Hyperdrive, so to win this award is just fantastic. Last year we launched HYVE, the UK’s largest independent battery pack manufacturing facility, to cater to the growing demand for clean energy on a global scale. The NEAA awards are a brilliant opportunity to celebrate the north east automotive community and showcase the best our region has to offer.” The awards ceremony took place on Friday 21 st February at the Roker Hotel in Sunderland where guests listened to Mike Hawes, Chief Executive at The Society of Motor Manufacturers and Traders (SMMT) who delivered the keynote address. SMMT is the trade association for UK motor industry and represents 800 automotive companies. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/industries/portable-energy-storage": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Industries > Portable Energy Storage Portable Energy Storage For remote locations, events and emergency response, connecting to the grid isn’t always an option. Our lithium-ion battery packs provide increased cost savings, reduced CO2 and pollution emissions whilst delivering reliable power on the go. Portable power supplies and generator sets Delivering electricity on demand for when connecting to the grid isn’t possible, battery powered portable power supplies and generators are rapidly growing in popularity. In 2018, the UK Government along with other nations released their Clean Air Strategy, outlining actions to improve air quality. Coupled with changing public attitude and low emission zones in towns and cities around the world, there is now a demand for portable clean energy. Read more Emergency backup power Providing power to homes and businesses on loss of normal grid supply, emergency response systems can be found throughout the world. Line malfunctions, extreme weather and scheduled blackouts keep demand for these systems high, but as regulations and public attitudes change, battery powered emergency response is growing in popularity. Read more Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/insights/news": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > News News All Blog Events News News 19th March, 2020 Business Continuity in Response to COVID-19 Read post News 3rd March, 2020 St Benedict’s Hospice named as Hyperdrive’s Charity of the Year 2020 Read post News 24th February, 2020 Hyperdrive win SME Company of the Year 2020 Read post News 31st January, 2020 Celebrating our Charity of the Year 2019 Read post News 23rd January, 2020 Hyperdrive partners with RS Sailing to power industry disrupting electric boat Read post News 29th November, 2019 Hyperdrive win Energy Innovation Award Read post News 13th November, 2019 Hyperdrive awarded battery supply contract for Snorkel’s industry leading zero emission Speed Level Read post News 8th November, 2019 Double win for Hyperdrive at the Sunderland Echo Portfolio Awards Read post News 23rd October, 2019 Hyperdrive win Manufacturer of the Year 2019 Read post 1 2 3 4 … 8 9 10 → Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close", "https://hyperdriveinnovation.com/accessibility": "Translated: Skip to content Home About Battery Energy Storage Industries Technology Manufacturing Tel: +44 (0) 191 640 4586 Email: info@hyperdriveinnovation.com Menu Close Home About Battery Energy Storage Industries Technology Manufacturing Insights Community Careers Contact Twitter LinkedIn Announcement: Business Continuity in Response to COVID-19 Find out more Home > Accessibility Accessibility Javascript We do use Javascript on this website, but we do so in an unobtrusive manner. This simply means that if you do not have Javascript enabled, you will still be able to use all aspects of this website. Alternate Text for images We realise that not everyone will be using a graphical browser to view our website. With this in mind every Image has been given a meaning full Alternate text description. This is to ensure that if your browser does not support images, you can still understand the context in which the image is delivered. Web Standards This web site has been designed to make it more accessible to a wider audience, including disabled users. This is because the site has been designed and developed using Web Standards. It is our belief that this website should be available to as many people as possible regardless of software, ability and hardware. For more information about Web Standards you can visit The Web Standards Homepage. Web Content Accessibility Guidelines All pages on this website have been designed to meet the requirements for Double A Compliance. Where this has not been possible certain pages have been designed instead to meet the next best standard – Single A. Double A Compliance is a web accessibility standard laid out by the W3C’s WAI in the WCAG 1.0. Find out more about WCAG Double A Compliance. Where indicated pages have been created using valid XHTML 1.0 and CSS to increase the compatibility and consistency of content for all users. Web pages will work better in a range of web browsers and assistive technologies. However, as a result of certain accessibility features you will benefit from using an up to date web browser. Contact us Do you want to know more about our battery energy storage solutions? Get in touch today. MAKE AN ENQUIRY Email info@hyperdriveinnovation.com Telephone +44 (0) 191 640 4586 Social Twitter LinkedIn Future Technology Centre | Barmston Court | Nissan Way | Sunderland | Tyne and Wear | SR5 3NY | United Kingdom NEWSLETTER SIGN UP: Sign Up © 2020 Hyperdrive Innovation Limited. Accessibility Terms and Conditions Privacy Policy Sitemap UN Safety Testing Downloads Delivered with Cargo Creative Close"}, "external_links": {"twitter": ["https://twitter.com/HyperdriveTech"], "other_links": ["https://www.cargocreative.co.uk", "tel://+44 (0) 191 640 4586"], "twitter_account": [], "linkedin": ["https://www.linkedin.com/company/hyperdrive-technologies-ltd"]}, "website_url": "http://hyperdriveinnovation.com", "internal_links": ["https://hyperdriveinnovation.com/insights/blog/the-female-university-student-trailblazing-the-world-of-engineering", "https://hyperdriveinnovation.com/careers", "https://hyperdriveinnovation.com/insights/blog/another-record-year-for-hyperdrive", "https://hyperdriveinnovation.com/insights/news", "https://hyperdriveinnovation.com/insights/news/st-benedicts-hospice-named-as-hyperdrives-charity-of-the-year-2020", "https://hyperdriveinnovation.com/insights/news/hyperdrive-win-manufacturer-of-the-year", "https://hyperdriveinnovation.com/technology", "https://hyperdriveinnovation.com/japan", "https://hyperdriveinnovation.com/insights/news/page/2", "https://hyperdriveinnovation.com/insights/news/page/3", "https://hyperdriveinnovation.com/insights/news/page/8", "https://hyperdriveinnovation.com/insights/news/hyperdrive-win-energy-innovation-award", "https://hyperdriveinnovation.com/insights/blog/meet-richard-our-new-placement-student", "https://hyperdriveinnovation.com/insights/events", "https://hyperdriveinnovation.com/insights/news/double-win-for-hyperdrive-at-the-sunderland-echo-portfolio-awards", "https://hyperdriveinnovation.com/insights/blog/our-top-electric-finds-at-bauma", "https://hyperdriveinnovation.com/insights/blog", "https://hyperdriveinnovation.com/terms-and-conditions", "https://hyperdriveinnovation.com/insights/blog/hyperdrive-in-conversation-with-ian-ellerington-head-of-technology-and-transfer-at-the-faraday-institution", "https://hyperdriveinnovation.com/sitemap", "https://hyperdriveinnovation.com/insights/news/hyperdrive-raises-vital-funds-for-4louis", "https://hyperdriveinnovation.com/industries/material-handling", "https://hyperdriveinnovation.com/china", "https://hyperdriveinnovation.com/insights/blog/the-geopolitics-of-funding-battery-technologies", "https://hyperdriveinnovation.com", "https://hyperdriveinnovation.com/our-community", "https://hyperdriveinnovation.com/industries/stationary-energy-storage", "https://hyperdriveinnovation.com/careers/senior-project-controller", "https://hyperdriveinnovation.com/insights/blog/page/2", "https://hyperdriveinnovation.com/insights/blog/hyperdrive-in-conversation-with-paul-butler-ceo-at-the-north-east-automotive-alliance", "https://hyperdriveinnovation.com/insights/news/page/10", "https://hyperdriveinnovation.com/accessibility", "https://hyperdriveinnovation.com/insights/blog/the-5-steps-to-electrification", "https://hyperdriveinnovation.com/about", "https://hyperdriveinnovation.com/insights/news/hyperdrive-win-sme-company-of-the-year", "https://hyperdriveinnovation.com/insights/news/business-continuity-in-response-to-covid-19", "https://hyperdriveinnovation.com/industries/off-highway", "https://hyperdriveinnovation.com/insights", "https://hyperdriveinnovation.com/un-safety-testing", "https://hyperdriveinnovation.com/insights/news/page/9", "https://hyperdriveinnovation.com/hyve-manufacturing", "https://hyperdriveinnovation.com/insights/news/page/4", "https://hyperdriveinnovation.com/insights/news/hyperdrive-awarded-battery-supply-contract-for-snorkels-ndustry-leading-zero-emission-speed-level", "https://hyperdriveinnovation.com/insights/blog/hyperdrive-in-conversation-with-ian-constance-ceo-at-the-advanced-propulsion-centre", "https://hyperdriveinnovation.com/industries/portable-energy-storage", "https://hyperdriveinnovation.com/insights/news/hyperdrive-partners-with-rs-sailing-to-power-industry-disrupting-electric-boat", "https://hyperdriveinnovation.com/battery-energy-storage", "https://hyperdriveinnovation.com/industries"]}, "indeed": null, "Twitter_account": [{"contributors": null, "truncated": true, "text": "📢 We're on the lookout for a Senior Project Controller to join Team Hyperdrive at our HQ in #Sunderland! \n\n➡️Click… https://t.co/dCd3BT0Jac", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1251101125920665600, "favorite_count": 1, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [92, 103], "text": "Sunderland"}], "urls": [{"url": "https://t.co/dCd3BT0Jac", "indices": [116, 139], "expanded_url": "https://twitter.com/i/web/status/1251101125920665600", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 1, "id_str": "1251101125920665600", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Fri Apr 17 10:52:07 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": false, "text": "RT @MAKEitSund: The commercial director of Sunderland-headquartered @HyperdriveTech has said that the company's continued production is a \"…", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1250742755820699649, "favorite_count": 0, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 576267847, "indices": [3, 14], "id_str": "576267847", "screen_name": "MAKEitSund", "name": "MAKE it Sunderland"}, {"id": 292164933, "indices": [68, 83], "id_str": "292164933", "screen_name": "HyperdriveTech", "name": "Hyperdrive Innovation"}], "hashtags": [], "urls": []}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 3, "id_str": "1250742755820699649", "favorited": false, "retweeted_status": {"contributors": null, "truncated": true, "text": "The commercial director of Sunderland-headquartered @HyperdriveTech has said that the company's continued productio… https://t.co/Xi3lq5zpaC", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1250741994365825025, "favorite_count": 5, "source": "<a href=\"https://mention.com\" rel=\"nofollow\">Mention </a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 292164933, "indices": [52, 67], "id_str": "292164933", "screen_name": "HyperdriveTech", "name": "Hyperdrive Innovation"}], "hashtags": [], "urls": [{"url": "https://t.co/Xi3lq5zpaC", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1250741994365825025", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 3, "id_str": "1250741994365825025", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": true, "default_profile_image": false, "id": 576267847, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "verified": false, "translator_type": "none", "profile_text_color": "333333", "profile_image_url_https": "https://pbs.twimg.com/profile_images/940621004015132672/nT7_yLUd_normal.jpg", "profile_sidebar_fill_color": "DDEEF6", "entities": {"url": {"urls": [{"url": "https://t.co/0U0zEoaU7T", "indices": [0, 23], "expanded_url": "http://www.MAKEitSunderland.com", "display_url": "MAKEitSunderland.com"}]}, "description": {"urls": []}}, "followers_count": 4401, "profile_sidebar_border_color": "FFFFFF", "id_str": "576267847", "profile_background_color": "C0DEED", "listed_count": 59, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 3532, "description": "Sunderland is open for business, open to business. Offering a remarkable range of opportunities for businesses of all sizes. #MAKEitSunderland", "friends_count": 1459, "location": "Sunderland, England", "profile_link_color": "E81C4F", "profile_image_url": "http://pbs.twimg.com/profile_images/940621004015132672/nT7_yLUd_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/576267847/1535552270", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "screen_name": "MAKEitSund", "lang": null, "profile_background_tile": false, "favourites_count": 2323, "name": "MAKE it Sunderland", "notifications": false, "url": "https://t.co/0U0zEoaU7T", "created_at": "Thu May 10 14:11:46 +0000 2012", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Thu Apr 16 11:05:03 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "lang": "en", "created_at": "Thu Apr 16 11:08:05 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": false, "text": "RT @insiderneast: Hyperdrive Innovation eyes long-term growth post Covid-19 https://t.co/nhNAYhDnhM https://t.co/nu3pKcFl6b", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1250741919845580800, "favorite_count": 0, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 118649926, "indices": [3, 16], "id_str": "118649926", "screen_name": "insiderneast", "name": "Insider"}], "hashtags": [], "urls": [{"url": "https://t.co/nhNAYhDnhM", "indices": [76, 99], "expanded_url": "https://www.insidermedia.com/news/north-east/hyperdrive-innovation-eyes-long-term-growth-post-covid-19", "display_url": "insidermedia.com/news/north-eas…"}], "media": [{"source_user_id": 118649926, "source_status_id_str": "1250691754883514369", "expanded_url": "https://twitter.com/insiderneast/status/1250691754883514369/photo/1", "display_url": "pic.twitter.com/nu3pKcFl6b", "url": "https://t.co/nu3pKcFl6b", "media_url_https": "https://pbs.twimg.com/media/EVtZgPwWAAIhh2I.png", "source_user_id_str": "118649926", "source_status_id": 1250691754883514369, "id_str": "1250691732045430786", "sizes": {"small": {"h": 439, "resize": "fit", "w": 436}, "large": {"h": 439, "resize": "fit", "w": 436}, "medium": {"h": 439, "resize": "fit", "w": 436}, "thumb": {"h": 150, "resize": "crop", "w": 150}}, "indices": [100, 123], "type": "photo", "id": 1250691732045430786, "media_url": "http://pbs.twimg.com/media/EVtZgPwWAAIhh2I.png"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 2, "id_str": "1250741919845580800", "favorited": false, "retweeted_status": {"contributors": null, "truncated": false, "text": "Hyperdrive Innovation eyes long-term growth post Covid-19 https://t.co/nhNAYhDnhM https://t.co/nu3pKcFl6b", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1250691754883514369, "favorite_count": 1, "source": "<a href=\"https://about.twitter.com/products/tweetdeck\" rel=\"nofollow\">TweetDeck</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [], "urls": [{"url": "https://t.co/nhNAYhDnhM", "indices": [58, 81], "expanded_url": "https://www.insidermedia.com/news/north-east/hyperdrive-innovation-eyes-long-term-growth-post-covid-19", "display_url": "insidermedia.com/news/north-eas…"}], "media": [{"expanded_url": "https://twitter.com/insiderneast/status/1250691754883514369/photo/1", "display_url": "pic.twitter.com/nu3pKcFl6b", "url": "https://t.co/nu3pKcFl6b", "media_url_https": "https://pbs.twimg.com/media/EVtZgPwWAAIhh2I.png", "id_str": "1250691732045430786", "sizes": {"small": {"h": 439, "resize": "fit", "w": 436}, "large": {"h": 439, "resize": "fit", "w": 436}, "medium": {"h": 439, "resize": "fit", "w": 436}, "thumb": {"h": 150, "resize": "crop", "w": 150}}, "indices": [82, 105], "type": "photo", "id": 1250691732045430786, "media_url": "http://pbs.twimg.com/media/EVtZgPwWAAIhh2I.png"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 2, "id_str": "1250691754883514369", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": true, "default_profile_image": false, "id": 118649926, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "verified": false, "translator_type": "none", "profile_text_color": "333333", "profile_image_url_https": "https://pbs.twimg.com/profile_images/725309970/Insider_Blue_normal.JPG", "profile_sidebar_fill_color": "DDEEF6", "entities": {"url": {"urls": [{"url": "http://t.co/ChNxOBkRzt", "indices": [0, 22], "expanded_url": "http://www.insidermedia.com", "display_url": "insidermedia.com"}]}, "description": {"urls": [{"url": "http://t.co/yu8p07zSw3", "indices": [115, 137], "expanded_url": "http://www.insidermedia.com/forms/nl_reg", "display_url": "insidermedia.com/forms/nl_reg"}]}}, "followers_count": 3698, "profile_sidebar_border_color": "C0DEED", "id_str": "118649926", "profile_background_color": "C0DEED", "listed_count": 91, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 16017, "description": "Breaking #business news, features and events. Got a story? Call 08449800187. Subscribe to our daily newsletters at http://t.co/yu8p07zSw3", "friends_count": 1041, "location": "Newcastle, UK", "profile_link_color": "1DA1F2", "profile_image_url": "http://pbs.twimg.com/profile_images/725309970/Insider_Blue_normal.JPG", "following": false, "geo_enabled": false, "profile_banner_url": "https://pbs.twimg.com/profile_banners/118649926/1478793819", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "screen_name": "insiderneast", "lang": null, "profile_background_tile": false, "favourites_count": 336, "name": "Insider", "notifications": false, "url": "http://t.co/ChNxOBkRzt", "created_at": "Mon Mar 01 10:17:36 +0000 2010", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": true, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Thu Apr 16 07:45:25 +0000 2020", "in_reply_to_status_id_str": null, "place": null, "extended_entities": {"media": [{"expanded_url": "https://twitter.com/insiderneast/status/1250691754883514369/photo/1", "display_url": "pic.twitter.com/nu3pKcFl6b", "url": "https://t.co/nu3pKcFl6b", "media_url_https": "https://pbs.twimg.com/media/EVtZgPwWAAIhh2I.png", "id_str": "1250691732045430786", "sizes": {"small": {"h": 439, "resize": "fit", "w": 436}, "large": {"h": 439, "resize": "fit", "w": 436}, "medium": {"h": 439, "resize": "fit", "w": 436}, "thumb": {"h": 150, "resize": "crop", "w": 150}}, "indices": [82, 105], "type": "photo", "id": 1250691732045430786, "media_url": "http://pbs.twimg.com/media/EVtZgPwWAAIhh2I.png"}]}}, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Thu Apr 16 11:04:46 +0000 2020", "in_reply_to_status_id_str": null, "place": null, "extended_entities": {"media": [{"source_user_id": 118649926, "source_status_id_str": "1250691754883514369", "expanded_url": "https://twitter.com/insiderneast/status/1250691754883514369/photo/1", "display_url": "pic.twitter.com/nu3pKcFl6b", "url": "https://t.co/nu3pKcFl6b", "media_url_https": "https://pbs.twimg.com/media/EVtZgPwWAAIhh2I.png", "source_user_id_str": "118649926", "source_status_id": 1250691754883514369, "id_str": "1250691732045430786", "sizes": {"small": {"h": 439, "resize": "fit", "w": 436}, "large": {"h": 439, "resize": "fit", "w": 436}, "medium": {"h": 439, "resize": "fit", "w": 436}, "thumb": {"h": 150, "resize": "crop", "w": 150}}, "indices": [100, 123], "type": "photo", "id": 1250691732045430786, "media_url": "http://pbs.twimg.com/media/EVtZgPwWAAIhh2I.png"}]}}, {"contributors": null, "truncated": true, "text": "🏥 The Innovation Centre in #Sunderland has been chosen as the site for a new #NHSNightingale Hospital. \n\n👏 Kudos an… https://t.co/mnU3TEXRSA", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1250046321001725954, "favorite_count": 2, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [27, 38], "text": "Sunderland"}, {"indices": [77, 92], "text": "NHSNightingale"}], "urls": [{"url": "https://t.co/mnU3TEXRSA", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1250046321001725954", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1250046321001725954", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Tue Apr 14 13:00:42 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": true, "text": "⚡️Fantastic to see our partner @Northpowergrid\n restoring the power supply to a local pharmacy in #SouthShields thi… https://t.co/1SpK2oewwU", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1248180070172278784, "favorite_count": 0, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 440366765, "indices": [31, 46], "id_str": "440366765", "screen_name": "Northpowergrid", "name": "Northern Powergrid"}], "hashtags": [{"indices": [98, 111], "text": "SouthShields"}], "urls": [{"url": "https://t.co/1SpK2oewwU", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1248180070172278784", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1248180070172278784", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Thu Apr 09 09:24:53 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": true, "text": "⚡️ Built in 1894, the Electrobat was the first successful #electriccar. It had a 1,600 pound lead battery! \n\n🔋 We'v… https://t.co/G482QCHeer", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1247501962393858051, "favorite_count": 0, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [58, 70], "text": "electriccar"}], "urls": [{"url": "https://t.co/G482QCHeer", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1247501962393858051", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1247501962393858051", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Tue Apr 07 12:30:19 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": false, "text": "RT @FaradayInst: Check out ‘Crunchie Bar Batteries’ 🍫 🔋 fun, home science experiment created by @B_Browning_ &amp; R Madge @FaradayInst https:/…", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1247057093816987648, "favorite_count": 0, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 877933416716611589, "indices": [3, 15], "id_str": "877933416716611589", "screen_name": "FaradayInst", "name": "Faraday Institution"}, {"id": 1229368210635489283, "indices": [96, 108], "id_str": "1229368210635489283", "screen_name": "B_Browning_", "name": "Beatrice Browning"}, {"id": 877933416716611589, "indices": [123, 135], "id_str": "877933416716611589", "screen_name": "FaradayInst", "name": "Faraday Institution"}], "hashtags": [], "urls": []}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 16, "id_str": "1247057093816987648", "favorited": false, "retweeted_status": {"contributors": null, "truncated": true, "text": "Check out ‘Crunchie Bar Batteries’ 🍫 🔋 fun, home science experiment created by @B_Browning_ &amp; R Madge @FaradayInst… https://t.co/1nbfvBeWrK", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1246089159229476865, "favorite_count": 31, "source": "<a href=\"http://twitter.com/download/iphone\" rel=\"nofollow\">Twitter for iPhone</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 1229368210635489283, "indices": [79, 91], "id_str": "1229368210635489283", "screen_name": "B_Browning_", "name": "Beatrice Browning"}, {"id": 877933416716611589, "indices": [106, 118], "id_str": "877933416716611589", "screen_name": "FaradayInst", "name": "Faraday Institution"}], "hashtags": [], "urls": [{"url": "https://t.co/1nbfvBeWrK", "indices": [120, 143], "expanded_url": "https://twitter.com/i/web/status/1246089159229476865", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 16, "id_str": "1246089159229476865", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 877933416716611589, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/959553488899502087/rq8G1GKj_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "https://t.co/sNCEmbLMHI", "indices": [0, 23], "expanded_url": "http://www.faraday.ac.uk", "display_url": "faraday.ac.uk"}]}, "description": {"urls": []}}, "followers_count": 2348, "profile_sidebar_border_color": "000000", "id_str": "877933416716611589", "profile_background_color": "000000", "listed_count": 38, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 467, "description": "The Faraday Institution is the UK’s independent institute for   electrochemical energy storage science and technology research.", "friends_count": 508, "location": "Harwell Campus, England", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/959553488899502087/rq8G1GKj_normal.jpg", "following": false, "geo_enabled": false, "profile_banner_url": "https://pbs.twimg.com/profile_banners/877933416716611589/1517610291", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "screen_name": "FaradayInst", "lang": null, "profile_background_tile": false, "favourites_count": 622, "name": "Faraday Institution", "notifications": false, "url": "https://t.co/sNCEmbLMHI", "created_at": "Thu Jun 22 16:56:52 +0000 2017", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Fri Apr 03 14:56:21 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "lang": "en", "created_at": "Mon Apr 06 07:02:35 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": true, "text": "🦺 Amidst the uncertainty of everything going on right now, we're on the lookout for a Senior Stores Person to join… https://t.co/v3vQMcA0jm", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1245667680176259072, "favorite_count": 1, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [], "urls": [{"url": "https://t.co/v3vQMcA0jm", "indices": [116, 139], "expanded_url": "https://twitter.com/i/web/status/1245667680176259072", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 1, "id_str": "1245667680176259072", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Thu Apr 02 11:01:32 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": true, "text": "🇧🇪 #DidYouKnow that in 1899, Belgian born Camille Jenatzy broke the 100 km/h speed barrier in a battery powered… https://t.co/4egsipIUZU", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1244936006656315394, "favorite_count": 3, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [3, 14], "text": "DidYouKnow"}], "urls": [{"url": "https://t.co/4egsipIUZU", "indices": [113, 136], "expanded_url": "https://twitter.com/i/web/status/1244936006656315394", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1244936006656315394", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Tue Mar 31 10:34:08 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": false, "text": "👏👏👏 https://t.co/7KGZM77oIa", "is_quote_status": true, "in_reply_to_status_id": null, "id": 1244570299577794560, "favorite_count": 0, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "quoted_status_id": 1244550277946015749, "retweeted": false, "coordinates": null, "quoted_status": {"contributors": null, "truncated": true, "text": "A breathing aid that can help keep #COVID19 patients out of intensive care, adapted by mechanical engineers at @UCL… https://t.co/uLZDYhn3pd", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1244550277946015749, "favorite_count": 7405, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 322601789, "indices": [111, 115], "id_str": "322601789", "screen_name": "ucl", "name": "UCL"}], "hashtags": [{"indices": [35, 43], "text": "COVID19"}], "urls": [{"url": "https://t.co/uLZDYhn3pd", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1244550277946015749", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 1908, "id_str": "1244550277946015749", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 26235265, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "verified": true, "translator_type": "none", "profile_text_color": "333333", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1244956308824088576/8V9YYtKH_normal.jpg", "profile_sidebar_fill_color": "EDEDED", "entities": {"url": {"urls": [{"url": "https://t.co/htQ0iY71Yo", "indices": [0, 23], "expanded_url": "http://www.MercedesAMGF1.com", "display_url": "MercedesAMGF1.com"}]}, "description": {"urls": []}}, "followers_count": 2553727, "profile_sidebar_border_color": "FFFFFF", "id_str": "26235265", "profile_background_color": "000000", "listed_count": 33643, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 107685, "description": "#StayAtHome", "friends_count": 3786, "location": "", "profile_link_color": "00A19C", "profile_image_url": "http://pbs.twimg.com/profile_images/1244956308824088576/8V9YYtKH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/26235265/1585571826", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "screen_name": "MercedesAMGF1", "lang": null, "profile_background_tile": false, "favourites_count": 79123, "name": "Mercedes-AMG F1", "notifications": false, "url": "https://t.co/htQ0iY71Yo", "created_at": "Tue Mar 24 13:24:04 +0000 2009", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Mon Mar 30 09:01:23 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, "entities": {"symbols": [], "user_mentions": [], "hashtags": [], "urls": [{"url": "https://t.co/7KGZM77oIa", "indices": [4, 27], "expanded_url": "https://twitter.com/MercedesAMGF1/status/1244550277946015749", "display_url": "twitter.com/MercedesAMGF1/…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1244570299577794560", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "und", "created_at": "Mon Mar 30 10:20:57 +0000 2020", "quoted_status_id_str": "1244550277946015749", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": false, "text": "🇵🇱 Poland counted 9,803 #ElectricVehicles last month, a 181% increase from February last year! \n\n🚗 ⚡️ 🔋 https://t.co/QZNnlndNO0", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1243174197393788929, "favorite_count": 2, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [24, 41], "text": "ElectricVehicles"}], "urls": [], "media": [{"expanded_url": "https://twitter.com/HyperdriveTech/status/1243174197393788929/photo/1", "display_url": "pic.twitter.com/QZNnlndNO0", "url": "https://t.co/QZNnlndNO0", "media_url_https": "https://pbs.twimg.com/media/EUCg_iLWsAE10YS.jpg", "id_str": "1243170510520889345", "sizes": {"small": {"h": 349, "resize": "fit", "w": 680}, "large": {"h": 820, "resize": "fit", "w": 1600}, "medium": {"h": 615, "resize": "fit", "w": 1200}, "thumb": {"h": 150, "resize": "crop", "w": 150}}, "indices": [104, 127], "type": "photo", "id": 1243170510520889345, "media_url": "http://pbs.twimg.com/media/EUCg_iLWsAE10YS.jpg"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1243174197393788929", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Thu Mar 26 13:53:20 +0000 2020", "in_reply_to_status_id_str": null, "place": null, "extended_entities": {"media": [{"expanded_url": "https://twitter.com/HyperdriveTech/status/1243174197393788929/photo/1", "display_url": "pic.twitter.com/QZNnlndNO0", "url": "https://t.co/QZNnlndNO0", "media_url_https": "https://pbs.twimg.com/media/EUCg_iLWsAE10YS.jpg", "id_str": "1243170510520889345", "sizes": {"small": {"h": 349, "resize": "fit", "w": 680}, "large": {"h": 820, "resize": "fit", "w": 1600}, "medium": {"h": 615, "resize": "fit", "w": 1200}, "thumb": {"h": 150, "resize": "crop", "w": 150}}, "indices": [104, 127], "type": "photo", "id": 1243170510520889345, "media_url": "http://pbs.twimg.com/media/EUCg_iLWsAE10YS.jpg"}]}}, {"contributors": null, "truncated": true, "text": "🚗 Our friends at the North East Automotive Alliance have put together a very helpful package of information to help… https://t.co/I2n4voXXCi", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1242090839322525696, "favorite_count": 1, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [], "urls": [{"url": "https://t.co/I2n4voXXCi", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1242090839322525696", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1242090839322525696", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Mon Mar 23 14:08:27 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": false, "text": "@jramjee1 Hi @jramjee1, as we're privately held, we unfortunately don't do public trading. If this is to ever change, we can let you know 🙂", "is_quote_status": false, "in_reply_to_status_id": 1240760102312980487, "id": 1240920309395607554, "favorite_count": 0, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 288318877, "indices": [0, 9], "id_str": "288318877", "screen_name": "jramjee1", "name": "Jaysheel Ramjee"}, {"id": 288318877, "indices": [13, 22], "id_str": "288318877", "screen_name": "jramjee1", "name": "Jaysheel Ramjee"}], "hashtags": [], "urls": []}, "in_reply_to_screen_name": "jramjee1", "in_reply_to_user_id": 288318877, "retweet_count": 0, "id_str": "1240920309395607554", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": "288318877", "lang": "en", "created_at": "Fri Mar 20 08:37:11 +0000 2020", "in_reply_to_status_id_str": "1240760102312980487", "place": null}, {"contributors": null, "truncated": false, "text": "@jramjee1 Hi @jramjee1, hope you're well. We're a privately listed company 🙂", "is_quote_status": false, "in_reply_to_status_id": 1240648208935792641, "id": 1240652522122952706, "favorite_count": 0, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 288318877, "indices": [0, 9], "id_str": "288318877", "screen_name": "jramjee1", "name": "Jaysheel Ramjee"}, {"id": 288318877, "indices": [13, 22], "id_str": "288318877", "screen_name": "jramjee1", "name": "Jaysheel Ramjee"}], "hashtags": [], "urls": []}, "in_reply_to_screen_name": "jramjee1", "in_reply_to_user_id": 288318877, "retweet_count": 0, "id_str": "1240652522122952706", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": "288318877", "lang": "en", "created_at": "Thu Mar 19 14:53:06 +0000 2020", "in_reply_to_status_id_str": "1240648208935792641", "place": null}, {"contributors": null, "truncated": true, "text": "🇬🇧 During this time of unprecedented uncertainty, Team Hyperdrive would like to take this opportunity to wish you a… https://t.co/pAWi2ysBk3", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1240636817759764480, "favorite_count": 4, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [], "urls": [{"url": "https://t.co/pAWi2ysBk3", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1240636817759764480", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1240636817759764480", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Thu Mar 19 13:50:41 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": true, "text": "⚡️ Last #ConExpo2020 post we promise... \n\n🔋 It's been brilliant to see so much #electrification in the construction… https://t.co/QkKaQZKIm0", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1239560042027810818, "favorite_count": 1, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [8, 20], "text": "ConExpo2020"}, {"indices": [79, 95], "text": "electrification"}], "urls": [{"url": "https://t.co/QkKaQZKIm0", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1239560042027810818", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1239560042027810818", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Mon Mar 16 14:31:58 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": true, "text": "🇺🇸 Exciting to visit the @poweredaccess stand and see the SL30RTE powered by Hyperdrive! \n\n#ConExpo2020… https://t.co/VIG0cSkm4F", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1238394848522186752, "favorite_count": 1, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [{"id": 20053262, "indices": [25, 39], "id_str": "20053262", "screen_name": "poweredaccess", "name": "Snorkel"}], "hashtags": [{"indices": [91, 103], "text": "ConExpo2020"}], "urls": [{"url": "https://t.co/VIG0cSkm4F", "indices": [105, 128], "expanded_url": "https://twitter.com/i/web/status/1238394848522186752", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 1, "id_str": "1238394848522186752", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Fri Mar 13 09:21:54 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": true, "text": "🇺🇸 Great to see our HY Energy pack range on display at #ConExpo2020! \n\nRead more about our battery #energystorage s… https://t.co/L5cYUkl4JY", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1238122083336552449, "favorite_count": 4, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [55, 67], "text": "ConExpo2020"}, {"indices": [99, 113], "text": "energystorage"}], "urls": [{"url": "https://t.co/L5cYUkl4JY", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1238122083336552449", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 1, "id_str": "1238122083336552449", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Thu Mar 12 15:18:02 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": false, "text": "⚡️Great news for the #UK! 🔋\n\n#ElectricVehicles https://t.co/aLeB8QAGN0", "is_quote_status": true, "in_reply_to_status_id": null, "id": 1237729662215892998, "favorite_count": 1, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "quoted_status_id": 1237728901733986306, "retweeted": false, "coordinates": null, "quoted_status": {"contributors": null, "truncated": true, "text": "£500m to support the rollout of new rapid charging hubs, so that drivers are never more than 30 miles away from bei… https://t.co/DrcpL1UGrQ", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1237728901733986306, "favorite_count": 456, "source": "<a href=\"https://studio.twitter.com\" rel=\"nofollow\">Twitter Media Studio</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [], "urls": [{"url": "https://t.co/DrcpL1UGrQ", "indices": [117, 140], "expanded_url": "https://twitter.com/i/web/status/1237728901733986306", "display_url": "twitter.com/i/web/status/1…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 295, "id_str": "1237728901733986306", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 18904582, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme1/bg.png", "verified": true, "translator_type": "none", "profile_text_color": "333333", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1194187332171251712/g3rb-cyx_normal.jpg", "profile_sidebar_fill_color": "F3D0CC", "entities": {"url": {"urls": [{"url": "https://t.co/37HdQjEz76", "indices": [0, 23], "expanded_url": "https://www.gov.uk/government/organisations/hm-treasury", "display_url": "gov.uk/government/org…"}]}, "description": {"urls": []}}, "followers_count": 413387, "profile_sidebar_border_color": "FFFFFF", "id_str": "18904582", "profile_background_color": "FFFFFF", "listed_count": 3005, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 8698, "description": "We're the UK Government's economic and finance ministry. Our aim is to promote strong and sustainable economic growth.", "friends_count": 983, "location": "Westminster, London", "profile_link_color": "AF292E", "profile_image_url": "http://pbs.twimg.com/profile_images/1194187332171251712/g3rb-cyx_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/18904582/1584637466", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme1/bg.png", "screen_name": "hmtreasury", "lang": null, "profile_background_tile": false, "favourites_count": 490, "name": "HM Treasury", "notifications": false, "url": "https://t.co/37HdQjEz76", "created_at": "Mon Jan 12 16:04:17 +0000 2009", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Wed Mar 11 13:15:40 +0000 2020", "in_reply_to_status_id_str": null, "place": null}, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [21, 24], "text": "UK"}, {"indices": [29, 46], "text": "ElectricVehicles"}], "urls": [{"url": "https://t.co/aLeB8QAGN0", "indices": [47, 70], "expanded_url": "https://twitter.com/hmtreasury/status/1237728901733986306", "display_url": "twitter.com/hmtreasury/sta…"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 0, "id_str": "1237729662215892998", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Wed Mar 11 13:18:42 +0000 2020", "quoted_status_id_str": "1237728901733986306", "in_reply_to_status_id_str": null, "place": null}, {"contributors": null, "truncated": false, "text": "🇺🇸 We're having a fantastic time at #CONEXPOCONAGG in #LasVegas!  #ConExpo2020 https://t.co/ZZ8ZTKorIo", "is_quote_status": false, "in_reply_to_status_id": null, "id": 1237677634999463937, "favorite_count": 2, "source": "<a href=\"https://mobile.twitter.com\" rel=\"nofollow\">Twitter Web App</a>", "retweeted": false, "coordinates": null, "entities": {"symbols": [], "user_mentions": [], "hashtags": [{"indices": [36, 50], "text": "CONEXPOCONAGG"}, {"indices": [54, 63], "text": "LasVegas"}, {"indices": [66, 78], "text": "ConExpo2020"}], "urls": [], "media": [{"expanded_url": "https://twitter.com/HyperdriveTech/status/1237677634999463937/video/1", "display_url": "pic.twitter.com/ZZ8ZTKorIo", "url": "https://t.co/ZZ8ZTKorIo", "media_url_https": "https://pbs.twimg.com/ext_tw_video_thumb/1237669480211283968/pu/img/pZh4pqQemCg4jGrL.jpg", "id_str": "1237669480211283968", "sizes": {"large": {"h": 320, "resize": "fit", "w": 568}, "small": {"h": 320, "resize": "fit", "w": 568}, "medium": {"h": 320, "resize": "fit", "w": 568}, "thumb": {"h": 150, "resize": "crop", "w": 150}}, "indices": [79, 102], "type": "photo", "id": 1237669480211283968, "media_url": "http://pbs.twimg.com/ext_tw_video_thumb/1237669480211283968/pu/img/pZh4pqQemCg4jGrL.jpg"}]}, "in_reply_to_screen_name": null, "in_reply_to_user_id": null, "retweet_count": 1, "id_str": "1237677634999463937", "favorited": false, "user": {"follow_request_sent": false, "has_extended_profile": false, "profile_use_background_image": false, "default_profile_image": false, "id": 292164933, "profile_background_image_url_https": "https://abs.twimg.com/images/themes/theme13/bg.gif", "verified": false, "translator_type": "none", "profile_text_color": "000000", "profile_image_url_https": "https://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "profile_sidebar_fill_color": "000000", "entities": {"url": {"urls": [{"url": "http://t.co/oBt8UVlAca", "indices": [0, 22], "expanded_url": "http://www.hyperdriveinnovation.com", "display_url": "hyperdriveinnovation.com"}]}, "description": {"urls": []}}, "followers_count": 1852, "profile_sidebar_border_color": "000000", "id_str": "292164933", "profile_background_color": "000000", "listed_count": 79, "is_translation_enabled": false, "utc_offset": null, "statuses_count": 2017, "description": "🇬🇧 We design, develop and manufacture #lithiumion battery systems, providing the world with the right #energy at the right time ⚡️", "friends_count": 2137, "location": "United Kingdom", "profile_link_color": "1B95E0", "profile_image_url": "http://pbs.twimg.com/profile_images/1212726731267870721/kqVHRxkH_normal.jpg", "following": false, "geo_enabled": true, "profile_banner_url": "https://pbs.twimg.com/profile_banners/292164933/1544188517", "profile_background_image_url": "http://abs.twimg.com/images/themes/theme13/bg.gif", "screen_name": "HyperdriveTech", "lang": null, "profile_background_tile": false, "favourites_count": 3619, "name": "Hyperdrive Innovation", "notifications": false, "url": "http://t.co/oBt8UVlAca", "created_at": "Tue May 03 06:24:53 +0000 2011", "contributors_enabled": false, "time_zone": null, "protected": false, "default_profile": false, "is_translator": false}, "geo": null, "in_reply_to_user_id_str": null, "possibly_sensitive": false, "lang": "en", "created_at": "Wed Mar 11 09:51:57 +0000 2020", "in_reply_to_status_id_str": null, "place": null, "extended_entities": {"media": [{"additional_media_info": {"monetizable": false}, "expanded_url": "https://twitter.com/HyperdriveTech/status/1237677634999463937/video/1", "display_url": "pic.twitter.com/ZZ8ZTKorIo", "url": "https://t.co/ZZ8ZTKorIo", "media_url_https": "https://pbs.twimg.com/ext_tw_video_thumb/1237669480211283968/pu/img/pZh4pqQemCg4jGrL.jpg", "video_info": {"aspect_ratio": [71, 40], "duration_millis": 15082, "variants": [{"url": "https://video.twimg.com/ext_tw_video/1237669480211283968/pu/pl/43onE6jHoYCQQBIo.m3u8?tag=10", "content_type": "application/x-mpegURL"}, {"url": "https://video.twimg.com/ext_tw_video/1237669480211283968/pu/vid/568x320/sEDsjM9nqN7B3DrK.mp4?tag=10", "bitrate": 832000, "content_type": "video/mp4"}, {"url": "https://video.twimg.com/ext_tw_video/1237669480211283968/pu/vid/478x270/pBSYDmBhkiJUyujT.mp4?tag=10", "bitrate": 256000, "content_type": "video/mp4"}]}, "id_str": "1237669480211283968", "sizes": {"large": {"h": 320, "resize": "fit", "w": 568}, "small": {"h": 320, "resize": "fit", "w": 568}, "medium": {"h": 320, "resize": "fit", "w": 568}, "thumb": {"h": 150, "resize": "crop", "w": 150}}, "indices": [79, 102], "type": "video", "id": 1237669480211283968, "media_url": "http://pbs.twimg.com/ext_tw_video_thumb/1237669480211283968/pu/img/pZh4pqQemCg4jGrL.jpg"}]}}], "medium": {}, "twitter_data": "HyperdriveTech"}